[
  {
    "name": "Focus on mean time to recovery",
    "ring": "adopt",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "status": "moved in",
    "description": "\"\""
  },
  {
    "name": "Forward Secrecy",
    "ring": "adopt",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p><b>Forward Secrecy</b> (sometimes known as 'Perfect Forward Secrecy' or PFS) is a cryptographic technique that protects previous communications sessions even if a server’s master keys are later compromised. Despite being simple to enable for HTTPS connections, many servers are not configured this way, and we recommend enabling forward secrecy to improve security. Note that we don't generally like the word 'perfect' when used to describe cryptographic protocols -- even the best protocol can be broken by a flaw in implementation, random number generator, or by advances in cryptanalytic techniques. Even so, it is important to enable the best security available, while&nbsp;keeping informed of new attacks and protocol improvements.</p>\""
  },
  {
    "name": "Structured logging",
    "ring": "adopt",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "status": "moved in",
    "description": "\"\""
  },
  {
    "name": "Canary builds",
    "ring": "trial",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "Datensparsamkeit",
    "ring": "trial",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "status": "moved in",
    "description": "\"\""
  },
  {
    "name": "Front end instrumentation",
    "ring": "trial",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>With the proliferation of complex JavaScript websites and applications, we are finding that browser-side issues such as&nbsp;slow network&nbsp;calls, poor render times, and JavaScript errors can have a big impact on user experience. Server-side monitoring clearly does not help in these scenarios and often these types of issues are being missed. <strong>Front end instrumentation</strong> extends the types of monitoring we are used to with&nbsp;server-side code to the browser, allowing for early warning of potential issues and far easier diagnosis should&nbsp;production issues occur.</p>\""
  },
  {
    "name": "Hipster batch",
    "ring": "trial",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>There has been a lot of recent attention to the use of ATOM-style event feeds over HTTP as a method of integration. &nbsp;Instead of maintaining&nbsp;a live service to expose those feeds, it is often acceptable to use old-style scheduled batch processing to create and publish feed files. &nbsp;When combined with cloud technology like Amazon's S3 file storage and hypermedia linking, this can create a highly available, yet simple and testable solution. &nbsp;Our teams have started to call this old-meets-new approach '<strong>Hipster batch</strong>'.</p>\""
  },
  {
    "name": "Humane registry",
    "ring": "trial",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>A Microservice architecture by its very nature increases significantly the number of applications, services, and interactions in your deployed environments. Our projects are showing renewed focus on building <a href=\"\"http://martinfowler.com/bliki/HumaneRegistry.html\"\" target=\"\"_blank\"\" aria-label=\"\"Humane Registries. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\"><b>Humane Registries</b><span class=\"\"pop-out-icon\"\"></span></a> which aggregate information about running services from the live environment and present it in a form for humans to comprehend. These registries favor up-to-date information from running services instead of human-curated documentation.</p>\""
  },
  {
    "name": "Inverse Conway Maneuver",
    "ring": "trial",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>Conway's Law asserts that organizations are constrained to produce application designs which are copies of their communication structures. This often leads to unintended friction points. The '<b>Inverse Conway Maneuver</b>' recommends evolving your team and organizational structure to promote your desired architecture. Ideally your technology architecture will display isomorphism with your business architecture.</p>\""
  },
  {
    "name": "Living CSS Style Guides",
    "ring": "trial",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>A <b>living CSS style guide</b> is a page on your site that uses your current CSS styles and acts as a reference for all the currently available visual elements and design patterns. This helps to tightly integrate design into your delivery process by promoting co-ownership of the UI and avoids duplication of styling across your application. Styling changes are visible in the guide immediately and changes propagate across your site from a central location. A sensible way to do this is with a well organized SASS/LESS file structure with semantically named elements that separates structure, aesthetics, and interaction.</p>\""
  },
  {
    "name": "Local storage sync",
    "ring": "trial",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "NoPSD",
    "ring": "trial",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "Partition infrastructure along team bounds",
    "ring": "trial",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>Many of our customers have made DevOps a reality in their organization with delivery teams that build, deploy, and support their own applications and services. &nbsp;Unfortunately, a regular roadblock on that journey is allowing teams to have superuser privileges in production environments. &nbsp;In most organizations, the production environment is shared, and therefore risky to provide access widely. &nbsp;It is effective when we can <strong>partition infrastructure along team bounds,</strong> so that those teams can have safe isolated access to do their work, without risking impact to other systems. &nbsp;Where cloud environments are used, this is much easier to implement, aligning account structures to team boundaries.&nbsp;</p>\""
  },
  {
    "name": "REST without PUT",
    "ring": "trial",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>In the last radar we talked about Capturing Explicit Domain Events, putting emphasis on recording the business-meaningful events that have triggered state transitions instead of just CRUD'ing entities. REST interfaces commonly use PUT to update resource state, however it's often better to POST to record a new event resource which captures intent. <b>REST without PUT </b>has a side-benefit of separating command and query interfaces and forces consumers to allow for eventual consistency.</p>\""
  },
  {
    "name": "Static site generators",
    "ring": "trial",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong>Static site generators</strong> like Middleman or Jekyll have become popular for creating simple websites or blogs, but we are increasingly seeing their use as part of more complex application stacks. The default assumption that all content delivered over HTTP has to be dynamically created on request is shifting, with more teams looking to use static pre-generated content.</p>\""
  },
  {
    "name": "Tailored service templates",
    "ring": "trial",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>We see multiple organizations creating a <b>Tailored Service Template</b> which can be used to quickly seed new services, pre-configured to operate within that organization's production environment. The template contains a default set of decisions such as web frameworks, logging, monitoring, build, packaging, and deployment approaches. This is a very useful technique for encouraging collaborative evolution while retaining lightweight governance.</p>\""
  },
  {
    "name": "Accumulate-only data",
    "ring": "assess",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "Blockchain beyond bitcoin",
    "ring": "assess",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "Data Lake",
    "ring": "assess",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "Machine image pipelines",
    "ring": "assess",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>Many deployments requires machine images for different server roles like applications and services, databases, and reverse proxies. Because building a machine image from scratch, using an operating system ISO and provisioning scripts, can take a considerable amount of time it can be useful to create a <b>build pipeline for machine images</b>. The first stage in the pipeline sets up a base image according to general standards in the organization. Subsequent stages can then enhance the base image for different purposes. If several applications or services have similar requirements, an application server for example, the pipeline can be extended by an intermediate stage, which takes the base image and provides an image with an application server but no application/service. These pipelines are not linear, they are trees that are branching out from the base image.</p>\""
  },
  {
    "name": "Pace-layered Application Strategy",
    "ring": "assess",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>Gartner's <strong>Pace-layered Application Strategy</strong> approach to architecture attempts to articulate the fact that decisions about architecture should not be a one-size fits all approach. Instead, it is important to take a balanced view of&nbsp;your technology portfolio. We have qualms about some of the prescriptive recommendations that come with Pace. In particular, we have&nbsp;found some situations where the layering concept is too simplistic. That said, we believe the core idea that different components and systems within an architecture need&nbsp;to change at different paces is sound.</p>\""
  },
  {
    "name": "Cloud lift and shift",
    "ring": "hold",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>As cloud adoption grows we are unfortunately seeing a trend to treat the cloud as just another hosting provider. <b>Cloud lift and shift</b> is unfortunately being encouraged by large vendors re-branding existing hosting offerings as \"\"cloud.\"\" Few of these offer any real flexibility or pay-as-you-use pricing. If you think you can move to the cloud without re-architecting, you are probably not doing it right.</p>\""
  },
  {
    "name": "Long-lived branches with Gitflow",
    "ring": "hold",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "Microservice envy",
    "ring": "hold",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "Programming in your CI/CD tool",
    "ring": "hold",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "SAFe™",
    "ring": "hold",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "Security sandwich",
    "ring": "hold",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>Traditional approaches to security have relied on up-front specification followed by validation at the end. This <strong>“Security Sandwich”</strong> approach is hard to integrate into Agile teams, since much of the design happens throughout the process, and it does not leverage the automation opportunities provided by continuous delivery. Organizations should look at how they can inject security practices throughout the agile development cycle. This includes: evaluating the right level of Threat Modeling to do up-front; when to classify security concerns as their own stories, acceptance criteria, or cross-cutting non-functional requirements; including automatic static and dynamic security testing into your build pipeline; and how to include deeper testing, such as penetration testing, into releases in&nbsp;a continuous delivery&nbsp;model. In much the same way that DevOps has recast how historically adversarial&nbsp;groups can work together, the same is happening for security and development professionals.&nbsp;</p>\""
  },
  {
    "name": "Separate DevOps team",
    "ring": "hold",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"\""
  },
  {
    "name": "Testing as a separate organization",
    "ring": "hold",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>We continue to see organizations create separate Development and QA teams. Fast feedback is a core tenet of Agile and critical to the success of a project. Using a separate QA team slows down this feedback, creates an \"\"us and them\"\" mentality and makes it more difficult to build quality into the software. Testing should be a tightly integrated activity and isn't something the team can outsource. We recommend integrated teams where testers work closely with developers instead of having <b>testing as a separate organization.</b></p>\""
  },
  {
    "name": "Velocity as productivity",
    "ring": "hold",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>We continue to see teams and organizations equating velocity with productivity. When properly used, velocity allows the incorporation of \\”yesterday's weather\\”&nbsp;into a team’s internal iteration planning process. The key here is that velocity is an internal measure for a team, it is just a capacity estimate for that given team at that given time. Organizations and managers who equate internal velocity with external productivity start to set targets for velocity, forgetting that what actually matters is working software in production. Treating <b>velocity as productivity</b> leads to unproductive team behaviors that optimize this metric at the expense of actual working software.</p>\""
  },
  {
    "name": "DigitalOcean",
    "ring": "trial",
    "quadrant": "platforms",
    "isNew": "FALSE",
    "status": "moved in",
    "description": "\"\""
  },
  {
    "name": "Docker",
    "ring": "trial",
    "quadrant": "platforms",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>Since our last radar, <a href=\"\"https://www.docker.com/\"\" target=\"\"_blank\"\" aria-label=\"\"Docker. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\"><strong>Docker</strong><span class=\"\"pop-out-icon\"\"></span></a> has hit 1.0 and has been declared production ready by the authors. During this same period we have seen an explosion of tools based on Docker. We now have PAAS solutions in the form of <a href=\"\"http://deis.io/\"\" target=\"\"_blank\"\" aria-label=\"\"Deis. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Deis<span class=\"\"pop-out-icon\"\"></span></a>, cluster management in <a href=\"\"https://coreos.com/using-coreos/clustering/\"\" target=\"\"_blank\"\" aria-label=\"\"CoreOS. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">CoreOS<span class=\"\"pop-out-icon\"\"></span></a> and&nbsp;<a href=\"\"https://github.com/googlecloudplatform/kubernetes\"\" target=\"\"_blank\"\" aria-label=\"\"Kubernetes. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Kubernetes<span class=\"\"pop-out-icon\"\"></span></a>, and <a href=\"\"http://msopentech.com/blog/2014/08/28/docker-containers-on-microsoft-azure-with-kubernetes-visualizer/\"\" target=\"\"_blank\"\" aria-label=\"\"Microsoft. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Microsoft<span class=\"\"pop-out-icon\"\"></span></a>, <a href=\"\"https://cloud.google.com/compute/docs/containers\"\" target=\"\"_blank\"\" aria-label=\"\"Google. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Google<span class=\"\"pop-out-icon\"\"></span></a>,&nbsp;<a href=\"\"http://aws.amazon.com/blogs/aws/cloud-container-management/\"\" target=\"\"_blank\"\" aria-label=\"\"AWS. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">AWS<span class=\"\"pop-out-icon\"\"></span></a>&nbsp;and&nbsp;a host of smaller players&nbsp;are offering or will shortly offer&nbsp;Docker hosting. Microsoft is even <a href=\"\"http://www.zdnet.com/docker-container-support-coming-to-microsofts-next-windows-server-release-7000034708/\"\" target=\"\"_blank\"\" aria-label=\"\"looking to support Docker. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">looking to support Docker<span class=\"\"pop-out-icon\"\"></span></a> in their next version of Windows Server.&nbsp;Aside from all this change, Docker is being used in anger now by many people, for dev &amp; test and for production loads.&nbsp;We fully expect to see a large pace of change in the Docker ecosystem over&nbsp;the next year, and strongly suggest you take a look at what Docker could offer your own organisation.</p>\""
  },
  {
    "name": "iBeacon",
    "ring": "trial",
    "quadrant": "platforms",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p><b>iBeacons</b> are the Apple implementation of the broader category of beacons, which are small devices that use low energy Bluetooth (BLE) to provide fine-grained proximity information for mobile phones and other devices. Despite the hype surrounding iBeacons and the limitations to the accuracy and reliability of the information they provide, we do feel that they open interesting opportunities as trigger points for interacting with your users in a contextually relevant manner.</p>\""
  },
  {
    "name": "Apache Mesos",
    "ring": "assess",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "Apache Spark",
    "ring": "assess",
    "quadrant": "platforms",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>For iterative processing such as machine learning and interactive analysis, Hadoop map-reduce does not work very well because of its batch-oriented nature. <b>Spark</b> is a fast and general engine for large-scale data processing. It aims to extend map-reduce for iterative algorithms and interactive low latency data mining. It also ships with a machine learning library.</p>\""
  },
  {
    "name": "ARM Server SoC",
    "ring": "assess",
    "quadrant": "platforms",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>AMD recently released an <a href=\"\"http://www.anandtech.com/show/7989/amd-announces-project-skybridge-pincompatible-arm-and-x86-socs-in-2015\"\" target=\"\"_blank\"\" aria-label=\"\"8-core ARM SoC (System on a Chip). This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">8-core <b>ARM SoC</b> (System on a Chip)<span class=\"\"pop-out-icon\"\"></span></a> designed for servers and has committed to releasing an ARM SoC with integrated graphics in 2015. ARM-based servers are an interesting alternative to x86 because they are significantly more energy efficient. For some workloads, building an ARM-powered Cloud is preferable.</p>\""
  },
  {
    "name": "CoAP",
    "ring": "assess",
    "quadrant": "platforms",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p><a href=\"\"http://coap.technology/\"\" target=\"\"_blank\"\" aria-label=\"\"CoAP. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\"><b>CoAP</b><span class=\"\"pop-out-icon\"\"></span></a> is an open standards communication protocol for the Internet of Things (IoT). While there is currently a proliferation of competing standards in the IoT space, we particularly like CoAP. It is specifically designed for resource-constrained devices and local radio networks. It uses UDP for transport, but is semantically compatible with HTTP. CoAP uses a web-based model of devices with their own URLs and a request-response paradigm that supports RESTful and decentralized approaches.</p>\""
  },
  {
    "name": "CoreOS",
    "ring": "assess",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "EventStore",
    "ring": "assess",
    "quadrant": "platforms",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>Given the popularity of event sourcing, it is no surprise that tools in this space are maturing. <a href=\"\"http://geteventstore.com\"\" target=\"\"_blank\"\" aria-label=\"\"EventStore. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\"><b>EventStore</b><span class=\"\"pop-out-icon\"\"></span></a> is an open source functional database for storing immutable events and performing complex event processing on the event streams. Unlike other tools in this space, EventStore exposes event streams as Atom collections which therefore require no special infrastructure such as message buses or highly specialized clients to use.&nbsp;</p>\""
  },
  {
    "name": "Jackrabbit Oak",
    "ring": "assess",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "Linux Security Modules",
    "ring": "assess",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "Mapbox",
    "ring": "assess",
    "quadrant": "platforms",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p><a href=\"\"http://mapbox.com\"\" target=\"\"_blank\"\" aria-label=\"\"Mapbox. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\"><b>Mapbox</b><span class=\"\"pop-out-icon\"\"></span></a> is an open mapping platform we have used on several projects. It allows a developer to quickly add a map to an application and to style the map. Mapbox can serve as an alternative to conventional mapping platforms, and it also allows for mobile friendly maps.</p>\""
  },
  {
    "name": "MariaDB",
    "ring": "assess",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "Netflix OSS Full stack",
    "ring": "assess",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "OpenAM",
    "ring": "assess",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>When Oracle ceased&nbsp;development on&nbsp;Sun’s OpenSSO—an open source access management platform—It was picked up by ForgeRock and integrated into their Open Identity Suite. &nbsp;Now named <strong><a href=\"\"http://forgerock.com/products/open-identity-stack/openam/\"\" target=\"\"_blank\"\" aria-label=\"\"OpenAM. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">OpenAM<span class=\"\"pop-out-icon\"\"></span></a></strong>, it fills the niche for a scalable, open-source platform that supports a variety of federated identity&nbsp;standards, including OpenID Connect and SAML 2.0. &nbsp;These standards are a necessary enabler for secure microservice implementations.</p>\""
  },
  {
    "name": "OpenID Connect",
    "ring": "assess",
    "quadrant": "platforms",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p><b>OpenID Connect</b> is a standard protocol for federated identity built on OAuth 2.0. It addresses a long-standing need for a simple, web-based protocol to exchange trusted authentication and authorization information. Previous standards like SAML or generic OAuth 2.0 have proven too broad and complex to ensure universal compatibility. Our hope is that OpenID Connect can provide a useful basis for secure access to RESTful microservices with authenticated end-user identity.</p>\""
  },
  {
    "name": "SDN",
    "ring": "assess",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "Text it as a service / Rapidpro.io",
    "ring": "assess",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "TOTP Two-Factor Authentication",
    "ring": "assess",
    "quadrant": "platforms",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p><b>Two-factor authentication</b> significantly improves security over simple password-based systems. <a href=\"\"http://tools.ietf.org/html/rfc6238\"\" target=\"\"_blank\"\" aria-label=\"\"RFC 6238. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">RFC 6238<span class=\"\"pop-out-icon\"\"></span></a> -- <a href=\"\"http://en.wikipedia.org/wiki/Time-based_One-time_Password_Algorithm\"\" target=\"\"_blank\"\" aria-label=\"\"Time-based One-Time Password. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Time-based One-Time Password<span class=\"\"pop-out-icon\"\"></span></a> Algorithm -- is a standard for two-factor authentication. 'Standard' authenticator apps from <a href=\"\"https://play.google.com/store/apps/details?id=com.google.android.apps.authenticator2\"\" target=\"\"_blank\"\" aria-label=\"\"Google. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Google<span class=\"\"pop-out-icon\"\"></span></a> and <a href=\"\"http://www.windowsphone.com/en-us/store/app/authenticator/e7994dbc-2336-4950-91ba-ca22d653759b\"\" target=\"\"_blank\"\" aria-label=\"\"Microsoft. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Microsoft<span class=\"\"pop-out-icon\"\"></span></a> provide tokens to smartphone users, and there are a number of other client and server implementations readily available. With providers such as Google, Facebook, Dropbox and Evernote using <b>TOTP</b>, there really is no excuse to continue using simple password-based authentication where stronger security would be appropriate.</p>\""
  },
  {
    "name": "U2F",
    "ring": "assess",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "CMS as a platform",
    "ring": "hold",
    "quadrant": "platforms",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>In previous editions of the radar, we have written about the pitfalls of trying to use a <strong>CMS as a platform</strong>&nbsp;and we continue to see this problematic approach “in the wild.” CMS as an editing, collaboration and&nbsp;workflow&nbsp;platform can work well, and we certainly do not discount these features.&nbsp;We have had success using <a href=\"\"http://martinfowler.com/articles/two-stack-cms/\"\" target=\"\"_blank\"\" aria-label=\"\"Two Stack CMS. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Two Stack CMS<span class=\"\"pop-out-icon\"\"></span></a>,&nbsp;an approach that <a href=\"\"http://martinfowler.com/bliki/EditingPublishingSeparation.html\"\" target=\"\"_blank\"\" aria-label=\"\"separates the concerns of editing and publishing. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">separates the concerns of <em>editing</em> and <em>publishing</em><span class=\"\"pop-out-icon\"\"></span></a> content.</p>\""
  },
  {
    "name": "OSGi",
    "ring": "hold",
    "quadrant": "platforms",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"\""
  },
  {
    "name": "Flyway",
    "ring": "adopt",
    "quadrant": "tools",
    "isNew": "FALSE",
    "status": "moved in",
    "description": "\"<p>With techniques such as continuous delivery becoming more mainstream, automated database migrations are a baseline capability&nbsp;for many software teams. While&nbsp;there are many tools in this space, we continue to recommend <strong>Flyway</strong> for its low-friction approach. Flyway has a vibrant open-source community behind it, and support for both traditional and cloud-based databases such as Amazon Redshift and Google Cloud SQL.</p>\""
  },
  {
    "name": "GoCD",
    "ring": "adopt",
    "quadrant": "tools",
    "isNew": "FALSE",
    "status": "moved in",
    "description": "\"\""
  },
  {
    "name": "Appium",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "FALSE",
    "status": "moved in",
    "description": "\"<p>Mobile test automation is becoming increasingly important. <a href=\"\"http://appium.io\"\" target=\"\"_blank\"\" aria-label=\"\"Appium. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\"><b>Appium</b><span class=\"\"pop-out-icon\"\"></span></a> is a test automation framework that can test mobile web, mobile native and mobile hybrid applications on iOS and Android. We have used this in multiple projects and have seen significant gains.&nbsp;At the core, Appium is a webserver that exposes a REST API, receiving connections from a client, listening for commands, executing those commands on a mobile device and responding with an HTTP response representing the result of the command execution. It allows tests to be written against iOS and Android&nbsp;using the same API. Appium is open source with easy setup using npm.</p>\""
  },
  {
    "name": "Boot2docker",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "Composer",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>Although the idea of dependency management is not new and considered to be a fundamental development practice, it is not widely adopted by the PHP community. <a href=\"\"https://getcomposer.org\"\" target=\"\"_blank\"\" aria-label=\"\"Composer. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Composer<span class=\"\"pop-out-icon\"\"></span></a> is a tool for dependency management in PHP. It is strongly influenced by tools from other technology&nbsp;stacks like Node's npm and Ruby's Bundler.&nbsp;</p>\""
  },
  {
    "name": "Cursive",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "Foreman",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>The big Cloud providers have clearly raised the bar for provisioning, monitoring, and configuration, simplifying these tasks dramatically through powerful tools. Organizations that want to keep their compute and storage resources in-house are looking for similar solutions that work within their organizational context. <a href=\"\"http://theforeman.org/\"\" target=\"\"_blank\"\" aria-label=\"\"Foreman. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\"><b>Foreman</b><span class=\"\"pop-out-icon\"\"></span></a> has worked really well for us, and it is open-source software, too.</p>\""
  },
  {
    "name": "GenyMotion",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>Device fragmentation in the Android world is often cited as a problem because it can be difficult to understand how your applications will behave on a large number of disparate platforms. <a href=\"\"http://genymotion.com\"\" target=\"\"_blank\"\" aria-label=\"\"GenyMotion. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\"><b>GenyMotion</b><span class=\"\"pop-out-icon\"\"></span></a> is an emulator which can mimic the characteristics of a number of different Android devices. Our teams have found this very effective in giving fast feedback for our Android applications.</p>\""
  },
  {
    "name": "GitLab",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "Grunt.js",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p><strong>Grunt</strong> is rapidly becoming the de facto JavaScript build tool with high adoption and a growing ecosystem. While slower than newer alternatives, such as Gulp, in terms of file processing, Grunt covers a broader set of build-related activities, has a proliferation of plugins and makes it easy to author and publish self-written plugins to npm.</p>\""
  },
  {
    "name": "IndexedDB",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "Packer",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>We featured 'Machine image as a build artifact' in the last Radar, as an excellent way to implement fast spin-up, immutable servers. The thing holding this technique back was the difficulty in building images, especially when targeting more than one platform. <a href=\"\"http://packer.io\"\" target=\"\"_blank\"\" aria-label=\"\"Packer. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\"><b>Packer</b><span class=\"\"pop-out-icon\"\"></span></a>&nbsp;solves this, using your configuration management tool of choice to create images for a number of platforms including AWS, Rackspace, DigitalOcean and even Docker and Vagrant, although we have found the VMWare support to be problematic.</p>\""
  },
  {
    "name": "Pact & Pacto",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>Consumer-Driven Contracts are a testing approach to help service interfaces evolve with confidence without unknowingly breaking consumers. The similarly named <a href=\"\"https://github.com/realestate-com-au/pact\"\" target=\"\"_blank\"\" aria-label=\"\"Pact. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\"><b>Pact</b><span class=\"\"pop-out-icon\"\"></span></a> and <a href=\"\"http://thoughtworks.github.io/pacto\"\" target=\"\"_blank\"\" aria-label=\"\"Pacto. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\"><b>Pacto</b><span class=\"\"pop-out-icon\"\"></span></a> are two new open-source tools which allow testing interactions between service providers and consumers in isolation against a contract. Both have grown out of projects which are building RESTful microservices and show great promise.</p>\""
  },
  {
    "name": "Papertrail",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "FALSE",
    "status": "moved in",
    "description": "\"<p>In the previous radar, we mentioned the log aggregation service <b>Papertrail</b> as a way to collect and analyze logs from a variety of sources including web&nbsp;servers, routers, databases and PaaS services. Our subsequent experiences using it and the&nbsp;integrations from PaaS providers such as Heroku nudge it into something we would happily recommend as a&nbsp;convenient and expedient option, notwithstanding our concerns&nbsp;about widespread adoption of services that centralize large quantities of data aggregated from multiple parties.</p>\""
  },
  {
    "name": "Postman",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><a href=\"\"http://www.getpostman.com/features\"\" target=\"\"_blank\"\" aria-label=\"\"Postman. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Postman<span class=\"\"pop-out-icon\"\"></span></a> is a Chrome extension that acts as a REST client in your browser, allowing you to create requests and inspect responses. &nbsp;It is a useful tool when developing an API&nbsp;or implementing a client to call an existing API. It offers a suite of extensions that allow you to use it as a full-blown test runner too, although we discourage&nbsp;the record and replay style of testing it promotes.</p>\""
  },
  {
    "name": "SnapCI",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>We mentioned Thoughtworks' <b>SnapCI</b> -- a hosted service that provides deployment pipelines -- on the last edition of the Radar. Since then, we have seen many teams successfully use SnapCI on their projects. If you need a simple continuous delivery solution in the cloud, SnapCI can provide it with one click. No hardware, no hassle.</p>\""
  },
  {
    "name": "Snowplow Analytics & Piwik",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>With increasing scrutiny over the privacy of data, more companies are concerned about sharing web analytics with third parties. <b>Snowplow Analytics and Piwik</b> are examples of open-source analytics platforms that can be self-hosted and provide a promising feature set and roadmap.</p>\""
  },
  {
    "name": "Swagger",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "FALSE",
    "status": "moved in",
    "description": "\"\""
  },
  {
    "name": "Xamarin",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "FALSE",
    "status": "moved in",
    "description": "\"\""
  },
  {
    "name": "Blackbox",
    "ring": "assess",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><a href=\"\"https://github.com/StackExchange/blackbox\"\" target=\"\"_blank\"\" aria-label=\"\"Blackbox. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\"><strong>Blackbox</strong><span class=\"\"pop-out-icon\"\"></span></a> is a simple tool for encrypting specific files while at rest in your source repository. This is particularly useful if you need to store passwords or private keys. Blackbox works with Git, Mercurial and Subversion and uses GPG for the encryption. &nbsp;Each user has their own key, which&nbsp;makes&nbsp;it easy to revoke access on a granular level.</p>\""
  },
  {
    "name": "Consul",
    "ring": "assess",
    "quadrant": "tools",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p><a href=\"\"http://consul.io\"\" target=\"\"_blank\"\" aria-label=\"\"Consul. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\"><b>Consul</b><span class=\"\"pop-out-icon\"\"></span></a> makes it simple for services to register themselves and discover other services via DNS or HTTP. It scales automatically, with service look up locally or across data centers. Consul also provides a flexible key/value store for dynamic configuration, with notification of configuration changes. The internal gossip protocol used by Consul is powered by the <a href=\"\"http://serfdom.io\"\" target=\"\"_blank\"\" aria-label=\"\"Serf. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Serf<span class=\"\"pop-out-icon\"\"></span></a> library, leveraging and building upon the membership and failure detection features.</p>\""
  },
  {
    "name": "Dc.js",
    "ring": "assess",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>We have recommended D3.js before and in this radar we want to extend our recommendation to <a href=\"\"http://dc-js.github.io/dc.js/\"\" target=\"\"_blank\"\" aria-label=\"\"Dc.js. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\"><strong>Dc.js</strong><span class=\"\"pop-out-icon\"\"></span></a>, a charting library based on D3 for exploring large multi-dimensional datasets. With D3, it shares the ease with which beautiful interactive graphs can be created. It is different in that it trades the flexibility to create almost any kind of data visualization for a simpler programming model to create common chart types.</p>\""
  },
  {
    "name": "Gorilla REPL",
    "ring": "assess",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"http://gorilla-repl.org/\"\" target=\"\"_blank\"\" aria-label=\"\"GorillaREPL. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">GorillaREPL<span class=\"\"pop-out-icon\"\"></span></a></strong> is a tool for creating nicely-rendered documents consisting of text,&nbsp;live Clojure code, and plots. &nbsp;In some ways similar to iPython notebooks, GorillaREPL should be particularly useful for data analysts or code&nbsp;tutorials. &nbsp;But beyond that, GorillaREPL is fun!. &nbsp;It is a creative way to&nbsp;demonstrate&nbsp;the power&nbsp;of Clojure’s simple abstractions over immutable values.&nbsp;</p>\""
  },
  {
    "name": "Gulp",
    "ring": "assess",
    "quadrant": "tools",
    "isNew": "FALSE",
    "status": "moved out",
    "description": "\"<p>In the last radar we called out <strong>Gulp</strong> as a strong competitor to Grunt, with a clean API and fast builds thanks to its streaming approach. While we still like it as a tool, we are moving it out from trial back to assess since Grunt has both a broader usage model and better industry adoption and tooling. We do see some teams successfully using Gulp inside Grunt, when the speed of intermediate result caching is required, but we are not recommending it as the default&nbsp;JavaScript build tool.&nbsp;</p>\""
  },
  {
    "name": "leaflet.js",
    "ring": "assess",
    "quadrant": "tools",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p><a href=\"\"http://leafletjs.com\"\" target=\"\"_blank\"\" aria-label=\"\"Leaflet.js. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\"><b>Leaflet.js</b><span class=\"\"pop-out-icon\"\"></span></a> is a JavaScript library for mobile-friendly interactive maps. The library places a huge emphasis on performance, usability and simplicity, and as such works efficiently across mobile platforms and desktop browsers. It is a viable library to consider when building interactive maps for mobiles.</p>\""
  },
  {
    "name": "Mountebank",
    "ring": "assess",
    "quadrant": "tools",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>When testing services, we commonly need to stub out downstream collaborating services. Written by a Thoughtworker, <a href=\"\"http://www.mbtest.org\"\" target=\"\"_blank\"\" aria-label=\"\"Mountebank. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\"><b>Mountebank</b><span class=\"\"pop-out-icon\"\"></span></a> is a lightweight service which you can configure via HTTP that is capable of stubbing and mocking HTTP, HTTPS, SMTP and TCP.</p>\""
  },
  {
    "name": "Packetbeat",
    "ring": "assess",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "Roslyn",
    "ring": "assess",
    "quadrant": "tools",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p><b>Roslyn</b>, a .NET compiler platform under the Apache License 2.0, is a next-generation set of compilers for C# and VB.NET written entirely as managed code. It provides access to the compiler as a service and includes code analysis APIs allowing developers to access information from the compiler that was previously treated as a black box, for example syntactic and semantic models. The most immediate impact should be seen in enhancements to .NET IDEs through refactoring and code generation tools. We also expect to see improved code diagnostics and static analysis, although it will be interesting to see what the community comes up with. Meanwhile Xamarin has a Mono-compatible copy of Roslyn source code hosted on GitHub and plans to bundle Roslyn’s compilers with Mono as it stabilizes, in addition to integrating the best parts into their code base.</p>\""
  },
  {
    "name": "Terraform",
    "ring": "assess",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>With <strong>Terraform,</strong> cloud infrastructure can be managed by writing declarative definitions. The configuration of the servers instantiated by Terraform is usually left to tools like Puppet, Chef, or Ansible. We like Terraform because the syntax of its files is quite readable and because it supports multiple cloud providers while making no attempt to provide an artificial abstraction across these providers. At this stage, Terraform is new and not everything is implemented yet. We have also found its state management to be fragile, often needing awkward manual work to untangle.</p>\""
  },
  {
    "name": "Citrix for development",
    "ring": "hold",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "Go language",
    "ring": "adopt",
    "quadrant": "languages-and-frameworks",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>The <a href=\"\"https://golang.org/\"\" target=\"\"_blank\"\" aria-label=\"\"Go language. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\"><b>Go language</b><span class=\"\"pop-out-icon\"\"></span></a> gradually changed status from \"\"Just Another Language\"\" to a valuable tool in many projects. While steadfastly single paradigm in a world of increasingly complex languages, it seems to keep a nice balance between expressiveness, power, and simplicity.</p>\""
  },
  {
    "name": "Java 8",
    "ring": "adopt",
    "quadrant": "languages-and-frameworks",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>The team behind <b>Java 8</b> had to fight two battles: the community forces encouraging forever backwards compatibility (a long hallmark of Java) and the technical challenge of making a deep language change mesh with existing libraries and features. They succeeded on both fronts, breathing new life into the Java Language and placing it on par with other mainstream languages in terms of functional programming features. In particular, Java 8 has excellent syntactic magic that allows seamless interoperability between Lambda blocks, the new higher-order function feature, and SAM (Single Abstract Method) interfaces, the traditional way of passing behavior.</p>\""
  },
  {
    "name": "AngularJS",
    "ring": "trial",
    "quadrant": "languages-and-frameworks",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>We continue to see JavaScript frameworks as a useful way to structure code and bring better coding techniques to JavaScript. <b>AngularJS</b> is used widely by Thoughtworks projects. However, we are a bit concerned about the future of the framework. &nbsp;The 2.0 version&nbsp;currently under development represents a ground-up&nbsp;redesign that some might not be happy with. &nbsp;Without an evolutionary migration path, maintainers of existing AngularJS&nbsp;applications will be forced to either live with an unsupported version or undertake a large rewrite. &nbsp;We advise teams to first assess their requirements to understand if a single-page JavaScript application is really necessary. &nbsp;In many cases, a traditional page-model app&nbsp;is simpler to write and easier to maintain. &nbsp;Remember that there are&nbsp;other good alternatives to AngularJS,&nbsp;such as Ember.js,&nbsp;Knockout.js, and&nbsp;React.js.</p>\""
  },
  {
    "name": "Core Async",
    "ring": "trial",
    "quadrant": "languages-and-frameworks",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>The Clojure <b>core.async</b> library allows asynchronous communication using channels, with similar syntax and capabilities to Google's Go language. The core.async library solves many common problems in an elegant way, cleaning up event callback setup and adding simple concurrency primitives. It also highlights one of the advantages of the Lisp nature of Clojure: channels add operators that are consistent with existing Clojure operators, seamlessly weaving new functionality into the language core. In addition, core.async is supported in both Clojure and ClojureScript (despite JavaScript's lack of threads), utilizing underlying platform abstractions to provide a consistent interface to both languages.</p>\""
  },
  {
    "name": "Dashing",
    "ring": "trial",
    "quadrant": "languages-and-frameworks",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "Django REST",
    "ring": "trial",
    "quadrant": "languages-and-frameworks",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "HAL",
    "ring": "trial",
    "quadrant": "languages-and-frameworks",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>We see lots of teams creating RESTful interfaces without paying any attention to hypermedia. <a href=\"\"http://stateless.co/hal_specification.html\"\" target=\"\"_blank\"\" aria-label=\"\"HAL. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\"><b>HAL</b><span class=\"\"pop-out-icon\"\"></span></a> is a simple format for incorporating hyperlinks into JSON representations which is easy to implement and consume. HAL is well supported by libraries for parsing and representing JSON, and there are HAL-aware REST client libraries such as <a href=\"\"https://github.com/codegram/hyperclient\"\" target=\"\"_blank\"\" aria-label=\"\"Hyperclient. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Hyperclient<span class=\"\"pop-out-icon\"\"></span></a> which make it easy to navigate resources by following links.</p>\""
  },
  {
    "name": "Ionic Framework",
    "ring": "trial",
    "quadrant": "languages-and-frameworks",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "Nashorn",
    "ring": "trial",
    "quadrant": "languages-and-frameworks",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "Om",
    "ring": "trial",
    "quadrant": "languages-and-frameworks",
    "isNew": "FALSE",
    "status": "moved in",
    "description": "\"\""
  },
  {
    "name": "Q & Bluebird",
    "ring": "trial",
    "quadrant": "languages-and-frameworks",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p><a href=\"\"https://github.com/kriskowal/q\"\" target=\"\"_blank\"\" aria-label=\"\"Q. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\"><b>Q</b><span class=\"\"pop-out-icon\"\"></span></a> is a fully Promises/A+ compliant implementation in JavaScript that lets users compose promises arbitrarily deeply without the need for the deeply nested callbacks that obscure control flow. Q takes care of threading fulfilled values and rejected promises through the appropriate code paths. The space of Promises/A+ compliant libraries is currently very active with alternatives like <a href=\"\"https://github.com/petkaantonov/bluebird\"\" target=\"\"_blank\"\" aria-label=\"\"Bluebird. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\"><b>Bluebird</b><span class=\"\"pop-out-icon\"\"></span></a> also rapidly gaining mindshare.</p>\""
  },
  {
    "name": "R as Compute Platform",
    "ring": "trial",
    "quadrant": "languages-and-frameworks",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>R is traditionally used as stand alone analysis tool by research teams. With improvements in packages like Rook and RJSONIO, it has become trivial to wrap the computational logic and expose it as an API. Thoughtworks teams are using <b>R as Compute platform</b> to crunch large datasets in real time, using in-memory storage integrated with enterprise systems.</p>\""
  },
  {
    "name": "Retrofit",
    "ring": "trial",
    "quadrant": "languages-and-frameworks",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "Flight.js",
    "ring": "assess",
    "quadrant": "languages-and-frameworks",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>In the crowded space of JavaScript frameworks, we want to highlight <a href=\"\"https://flightjs.github.io/\"\" target=\"\"_blank\"\" aria-label=\"\"Flight.js. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\"><strong>Flight.js</strong><span class=\"\"pop-out-icon\"\"></span></a> as an alternative to consider. Flight is extremely lightweight and gets by without much magic when adding behavior to DOM nodes. Its event-driven and component-based nature promotes writing decoupled code. This makes testing individual components comparatively easy. Care must be taken, however, when components need to interact with each other. &nbsp;There is little support for testing and a real danger to get into <em>event hell</em>. We do like that it uses functional mixins for behaviour, like composition instead of inheritance.</p>\""
  },
  {
    "name": "Haskell Hadoop library",
    "ring": "assess",
    "quadrant": "languages-and-frameworks",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "Lotus",
    "ring": "assess",
    "quadrant": "languages-and-frameworks",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "React.js",
    "ring": "assess",
    "quadrant": "languages-and-frameworks",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>One benefit to the ongoing&nbsp;avalanche of front-end JavaScript frameworks is that occasionally, a new&nbsp;idea crops up that makes us think. &nbsp;<strong>React.js</strong> is a UI/View framework in which&nbsp;JavaScript functions&nbsp;generate HTML in a reactive data flow. &nbsp;Although we are wary of mixing code and markup, it results in UI components that are nicely encapsulated and composable. &nbsp;React.js is getting a lot of developer attention and will benefit&nbsp;from more tools and examples<strong><strong><strong><strong>&nbsp;</strong></strong></strong></strong>becoming available.</p>\""
  },
  {
    "name": "Reagent",
    "ring": "assess",
    "quadrant": "languages-and-frameworks",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"\""
  },
  {
    "name": "Rust",
    "ring": "assess",
    "quadrant": "languages-and-frameworks",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p><a href=\"\"http://www.rust-lang.org/\"\" target=\"\"_blank\"\" aria-label=\"\"Rust. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\"><b>Rust</b><span class=\"\"pop-out-icon\"\"></span></a> is a system programming language with modern affordances. It features a rich typing system, safe memory model and task-based concurrency. Compared to the Go language, Rust is more friendly to people who would like to write code in a functional style.</p>\""
  },
  {
    "name": "Spring Boot",
    "ring": "assess",
    "quadrant": "languages-and-frameworks",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p><a href=\"\"http://projects.spring.io/spring-boot\"\" target=\"\"_blank\"\" aria-label=\"\"Spring boot. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\"><b>Spring boot</b><span class=\"\"pop-out-icon\"\"></span></a> allows easy set up of standalone Spring-based applications. It's ideal for pulling up new microservices and easy to deploy. It also makes data access less of a pain due to the hibernate mappings with much less boilerplate code.</p>\""
  },
  {
    "name": "Swift",
    "ring": "assess",
    "quadrant": "languages-and-frameworks",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><a href=\"\"http://www.apple.com/swift/\"\" target=\"\"_blank\"\" aria-label=\"\"Swift,. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Swift,<span class=\"\"pop-out-icon\"\"></span></a> Apple’s new development language, contains many improvements over the perennial Objective-C, including emphasis on functional programming and modern syntax. In most ways, this is an upgrade if you are coding on the Apple platform.</p>\""
  },
  {
    "name": "JSF",
    "ring": "hold",
    "quadrant": "languages-and-frameworks",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"\""
  }
]
