[
  {
    "name": "Design systems",
    "ring": "adopt",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>As application development becomes increasingly dynamic and complex, it's a challenge to deliver accessible and usable products with consistent style. This is particularly true in larger organizations with multiple teams working on different products. <strong><a href=\"\"https://www.thoughtworks.com/insights/decoder/d/design-systems\"\">Design systems</a></strong> define a collection of design patterns, component libraries and good design and engineering practices that ensure consistent digital products. Evolved from the corporate style guides of the past, design systems offer shared libraries and documents that are easy to find and use. Generally, guidance is written down as code and kept under version control so that the guide is less ambiguous and easier to maintain than simple documents. Design systems have become a standard approach when working across teams and disciplines in product development because they allow teams to focus. They can address strategic challenges around the product itself without reinventing the wheel every time a new visual component is needed.</p><br><br><p>Our experiences show that teams seldom apply a product-centric mindset when building design systems. The primary consumers of the shared libraries and documents are the product development teams. When applying a product mindset, system owners should establish empathy with internal consumers (the development teams) and collaborate with them. We've found that the reason many component libraries are maligned is because the owning team wasn't able to give consumers what they needed fast enough and wasn't set up to take outside contributions. A product-centric mindset also requires organizations to think about if and how contributions should be made to the design system and how these contributions should be governed — on this topic, we recommend applying the <a href=\"\"https://www.thoughtworks.com/radar/techniques/design-system-decision-records\"\">design system decision records</a> technique. For us, running a good design system or component library requires social work as much as technical work.</p>\""
  },
  {
    "name": "Lightweight approach to RFCs",
    "ring": "adopt",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "status": "moved in",
    "description": "\"<p>A Request for Comments (RFC) is a formal document that includes context-dependent design and architectural ideas to facilitate team collaboration and decision-making. Nearly all digital native and scaleup organizations use RFCs to capture decisions around design, architecture, techniques and the ways their teams collaborate. Mature organizations have used RFCs in autonomous teams to drive better communication and collaboration, especially in cross-team decision-making. They're often used as a process to review and ratify <a href=\"\"https://www.thoughtworks.com/radar/techniques/lightweight-architecture-decision-records\"\">architecture decision records</a>. The result is a transparent collaborative process that allows those affected by a decision the chance to weigh in and provide input before the decision is ratified. So often in fast-moving environments, the reasoning leading up to design decisions gets lost along the way and teams who are responsible for implementing the decision are left scratching their heads. An RFC provides a decision audit record that benefits future team members and captures the technical and business evolution of an organization. An RFC can be a valuable tool for facilitating <a href=\"\"https://www.thoughtworks.com/radar/techniques/evolutionary-architecture\"\">evolutionary architecture</a>. For the best outcome, though, we recommend taking a <strong><em>lightweight</em> approach to RFCs</strong>. If not narrowly scoped and to the point, these documents tend to grow in length over time and start resembling traditional solution architecture documents that are filed away and forgotten.</p>\""
  },
  {
    "name": "Accessibility-aware component test design",
    "ring": "trial",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "status": "moved in",
    "description": "\"<p>One of the many places in the software delivery process where accessibility requirements should be considered is during web component testing. While testing framework plugins like <a href=\"\"https://www.npmjs.com/package/chai-a11y-axe\"\" target=\"\"_blank\"\" aria-label=\"\"chai-a11y-axe. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">chai-a11y-axe<span class=\"\"pop-out-icon\"\"></span></a> provide assertions in their API to check for the basics, <strong>accessibility-aware component test design</strong> can further help to provide all the semantic elements screen readers and other assistive technologies require. First, instead of using test ids or classes to find and select the elements you want to validate, use a principle of identifying elements by <a href=\"\"https://developer.mozilla.org/en-US/docs/Web/Accessibility/ARIA\"\" target=\"\"_blank\"\" aria-label=\"\"ARIA. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">ARIA<span class=\"\"pop-out-icon\"\"></span></a> roles or other semantic attributes that are used by assistive technologies. Some testing libraries, like <a href=\"\"https://testing-library.com/docs/queries/about/#priority\"\" target=\"\"_blank\"\" aria-label=\"\"Testing Library. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Testing Library<span class=\"\"pop-out-icon\"\"></span></a>, even recommend this in their documentation. Second, do not just test for click interactions; also consider people who cannot use a mouse or see the screen, and consider adding additional tests for the keyboard and other interactions. The described technique is well established within our teams, and we should have placed it in the Trial ring a while ago.</p>\""
  },
  {
    "name": "Attack path analysis",
    "ring": "trial",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong>Attack path analysis</strong> is a security analysis technique that identifies and assesses the potential paths that an attacker could take to exploit vulnerabilities in an organization's systems and networks. Previously most security analysis strategies or tools have focused on particular risk areas like misconfigurations, vulnerable containers or CVE alerts. This siloed approach means that teams cannot see how risks can be combined with weaknesses in other layers of the technology stack to create dangerous attack paths. Although this technique isn't new, recent advancements in security analysis tools have made it more accessible to security teams. <a href=\"\"https://www.thoughtworks.com/radar/platforms/orca\"\">Orca</a> and <a href=\"\"https://www.thoughtworks.com/radar/platforms/wiz\"\">Wiz</a> are two such tools. We suggest teams managing complex infrastructures consider this technique while planning a security strategy or selecting the security analysis tools for their organization.</p>\""
  },
  {
    "name": "Automatic merging of dependency update PRs",
    "ring": "trial",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>The complexity of the software supply chain is a major risk, and we've covered it extensively, for example, in our write-ups on <a href=\"\"https://www.thoughtworks.com/radar/techniques/software-bill-of-materials\"\" data-faitracker-click-bind=\"\"true\"\">SBOM</a> and <a href=\"\"https://www.thoughtworks.com/radar/techniques/slsa\"\" data-faitracker-click-bind=\"\"true\"\">SLSA</a>. The Achilles heel for most teams is still the presence of vulnerabilities in dependencies, often indirect dependencies several levels down. Tools such as <a href=\"\"https://www.thoughtworks.com/radar/tools/dependabot\"\" data-faitracker-click-bind=\"\"true\"\">Dependabot</a> help by creating pull requests (PRs) to update dependencies. It requires engineering discipline, though, to look after these PRs promptly, especially when they are for applications or services that are not under active development.</p><br><br><p>Under the right circumstances we now advocate for <strong>automatic merging of dependency update PRs</strong>. This requires that the system has extensive test coverage — not only unit tests but also functional and performance tests. The build pipeline must run all of these tests, and it must include security scanning. In short, the team must have full confidence that when the pipeline runs successfully the software is ready to go into production. In such cases, dependency update PRs, even when they include major version updates in indirect dependencies, should be merged automatically.</p>\""
  },
  {
    "name": "Data product thinking",
    "ring": "trial",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><a href=\"\"https://www.thoughtworks.com/en/what-we-do/data-and-ai/modern-data-engineering-playbook/data-as-a-product\"\">Data product thinking</a> prioritizes treating data consumers as customers, ensuring they have a seamless experience across the data value chain. This encompasses ease of data discovery, understanding, trust, access and consumption. \"\"Product thinking\"\" is not a new concept. In the past we've embraced this in the operational world while building operational products or microservices. It also suggests a new way to build long-lived cross-functional teams to own and share data across the organization. By bringing a product mindset to data, we believe organizations can operationalize the <a href=\"\"https://en.wikipedia.org/wiki/FAIR_data\"\" target=\"\"_blank\"\" aria-label=\"\"FAIR (findable, accessible, interoperable and reusable). This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">FAIR (findable, accessible, interoperable and reusable)<span class=\"\"pop-out-icon\"\"></span></a> principles. Our teams use data catalogs such as <a href=\"\"https://www.thoughtworks.com/radar/platforms/collibra\"\">Collibra</a> and <a href=\"\"https://www.thoughtworks.com/radar/platforms/datahub\"\">DataHub</a> to enable data product <a href=\"\"https://www.thoughtworks.com/radar/techniques/data-discoverability\"\">discoverability</a>. To foster trust, we publish data quality and <a href=\"\"https://en.wikipedia.org/wiki/Service_level_indicator\"\" target=\"\"_blank\"\" aria-label=\"\"SLI. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">SLI<span class=\"\"pop-out-icon\"\"></span></a> metrics like freshness, completeness, consistency for each data product, and tools such as <a href=\"\"https://www.thoughtworks.com/radar/tools/soda-core\"\">Soda Core</a> and <a href=\"\"https://www.thoughtworks.com/radar/tools/great-expectations\"\">Great Expectations</a> automate the data quality checks. <a href=\"\"https://www.thoughtworks.com/en/insights/blog/observability/data-observability\"\">Data Observability</a>, meanwhile, can be achieved with the help of platforms like <a href=\"\"https://www.thoughtworks.com/radar/platforms/monte-carlo\"\">Monte Carlo</a>. </p><br><br><p>We've seen data products evolve as the reusable building blocks for multiple use cases over a period of time. This is accompanied by faster time to market for subsequent use cases as we progress on identifying and building value case-driven data products. Hence, our advice is to embrace <strong>data product thinking for FAIR data</strong>.</p>\""
  },
  {
    "name": "OIDC for GitHub Actions",
    "ring": "trial",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>One of the techniques we recommend for implementing <a href=\"\"https://www.thoughtworks.com/radar/techniques/zero-trust-security-for-ci-cd\"\">zero trust security for CI/CD</a> is to authenticate your pipelines for cloud services access via federated identity mechanisms like OpenID Connect (OIDC). As <a href=\"\"https://www.thoughtworks.com/radar/platforms/github-actions\"\">GitHub Actions</a> is widely used — and this important technique remains underused — we want to call out <strong><a href=\"\"https://docs.github.com/en/actions/deployment/security-hardening-your-deployments/about-security-hardening-with-openid-connect\"\" target=\"\"_blank\"\" aria-label=\"\"OIDC for GitHub Actions. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">OIDC for GitHub Actions<span class=\"\"pop-out-icon\"\"></span></a></strong>. This way you can avoid storing long-lived access tokens for your cloud resources, and your pipelines won't get direct access to secrets. However, be sure to scope access carefully <a href=\"\"https://securitylabs.datadoghq.com/articles/exploring-github-to-aws-keyless-authentication-flaws/\"\" target=\"\"_blank\"\" aria-label=\"\"so that actions really run with least privilege. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">so that actions really run with least privilege<span class=\"\"pop-out-icon\"\"></span></a>.</p>\""
  },
  {
    "name": "Provision monitors and alerts with Terraform",
    "ring": "trial",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><a href=\"\"https://www.thoughtworks.com/radar/techniques/infrastructure-as-code\"\">Infrastructure as code (IaC)</a> is now a widely accepted approach for defining and provisioning hosting environments. Even with the continual evolution of tools and techniques in this area, <a href=\"\"https://www.thoughtworks.com/radar/tools/terraform\"\">Terraform</a> continues to be the dominant tool for doing IaC on cloud-native resources. However, most hosting environments today are complex combinations of cloud vendor–native services, third-party services and custom code. In these environments, we've found that engineers often resort to a mixture of Terraform for cloud resources and custom scripts for the rest. This can lead to a lack of consistency and repeatability in the provisioning process. In fact, many of the third-party services that are commonly used in hosting environments — including Splunk, Datadog, PagerDuty and New Relic — have Terraform providers that you can use to provision and configure these services. That's why we recommend that, in addition to cloud resources, teams also <strong>provision monitors and alerts with Terraform</strong>. This leads to IaC with better modularity that is easier to understand and maintain. As with all IaC, there is a risk of introducing inconsistencies when the configuration is changed via other interfaces. To ensure that the Terraform code remains the source of truth, we recommend you disable configuration changes via user interfaces and APIs.</p>\""
  },
  {
    "name": "ReAct prompting",
    "ring": "trial",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong>ReAct prompting</strong> is a method for prompting LLMs intended to improve the accuracy of their responses over competing methods such as <a href=\"\"https://blog.research.google/2022/05/language-models-perform-reasoning-via.html\"\" target=\"\"_blank\"\" aria-label=\"\"chain-of-thought (CoT). This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">chain-of-thought (CoT)<span class=\"\"pop-out-icon\"\"></span></a>. Introduced in a <a href=\"\"https://arxiv.org/abs/2210.03629\"\" target=\"\"_blank\"\" aria-label=\"\"2022 paper. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">2022 paper<span class=\"\"pop-out-icon\"\"></span></a>, it works by bringing together reasoning and action (hence ReAct). Such an approach helps make LLM responses more explainable and reduces hallucinations compared to CoT, giving prompters a better chance of getting what they want. <a href=\"\"https://www.thoughtworks.com/radar/languages-and-frameworks/langchain\"\">LangChain</a> was originally developed to support this style of prompting. <a href=\"\"https://www.thoughtworks.com/radar/techniques/llm-powered-autonomous-agents\"\">Autonomous agents</a> based on ReAct prompting have proven to be some of the most widely used applications of LLMs our teams have been building. Recently, OpenAI introduced <a href=\"\"https://openai.com/blog/function-calling-and-other-api-updates\"\" target=\"\"_blank\"\" aria-label=\"\"function calling. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">function calling<span class=\"\"pop-out-icon\"\"></span></a> to its APIs to make ReAct and similar prompting styles easier to implement without resorting to external tools like LangChain. We're still in the early stages of defining this discipline, but so far, ReAct and its descendants have pointed the way to some of the most exciting applications of LLMs.</p>\""
  },
  {
    "name": "Retrieval-augmented generation (RAG)",
    "ring": "trial",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://arxiv.org/abs/2005.11401v4\"\" target=\"\"_blank\"\" aria-label=\"\"Retrieval-Augmented Generation (RAG). This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Retrieval-Augmented Generation (RAG)<span class=\"\"pop-out-icon\"\"></span></a></strong> is a technique to combine pretrained parametric and nonparametric memory for language generation. It enables you to augment the existing knowledge of pretrained LLMs with the private and contextual knowledge of your domain or industry. With RAG, you first retrieve a set of relevant documents from the nonparametric memory (usually via a similarity search from a vector data store) and then use the parametric memory of LLMs to generate output that is consistent with the retrieved documents. We find RAG to be an effective technique for a variety of knowledge intensive NLP tasks — including question answering, summarization and story generation.</p>\""
  },
  {
    "name": "Risk-based failure modeling",
    "ring": "trial",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><a href=\"\"https://www.thoughtworks.com/insights/blog/risk-management-engineering-resilience\"\"><strong>Risk-based failure modeling</strong></a> is a process used to understand the impact, likelihood and ability of detecting the various ways that a system can fail. Delivery teams are starting to use this methodology to design and evaluate the controls needed to prevent these failures. The approach is based on the practice of <a href=\"\"https://en.wikipedia.org/wiki/Failure_mode_and_effects_analysis\"\" target=\"\"_blank\"\" aria-label=\"\"failure modes and effects analysis. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">failure modes and effects analysis<span class=\"\"pop-out-icon\"\"></span></a> (FMEA), a risk-scoring technique that has been around since the 1940s and with a successful track record in industries that build complex physical systems such as aerospace and automotive. As with those industries, software failure can also have dire consequences — compromising, for example, human health and privacy — which is why we're seeing an increased need for systems to undergo rigorous analysis. The process starts by identifying the possible failure modes. The team then performs a root cause analysis and assigns scores according to the likelihood of a failure occurring, the size of its impact and the probability of detecting the root cause of the failure. We've found this to be most effective when cross-functional teams iterate through this process as the system evolves. When it comes to security, risk-based failure modeling can be a useful complement to <a href=\"\"https://www.thoughtworks.com/radar/techniques/threat-modeling\"\">threat modeling</a> and attack path analysis.</p>\""
  },
  {
    "name": "Semi-structured natural language for LLMs",
    "ring": "trial",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>We've had success in various applications using a <strong>semi-structured natural language for LLMs</strong>. Structured inputs, such as a JSON document, are clear and precise and give the model an indication of the type of response being sought. Constraining the response in this way helps narrow the problem space and can produce more accurate completions, particularly when the structure conforms to a <a href=\"\"https://www.thoughtworks.com/radar/languages-and-frameworks/domain-specific-languages\"\">domain-specific language (DSL)</a> whose syntax or schema is provided to the model. We've also found that augmenting the structured input with natural language comments or notations produces a better response than either natural language or structured input alone. Typically, natural language is simply interspersed with structured content when constructing the prompt. As with many LLM behaviors, we don't know exactly why this works, but our experience shows that putting natural language comments in human-written code also improves the quality of output for LLM-based coding assistants.</p>\""
  },
  {
    "name": "Tracking health over debt",
    "ring": "trial",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "status": "moved in",
    "description": "\"<p>We keep experiencing the improvements teams make to their ecosystem by treating the health rating the same as other service-level objectives (SLOs) and prioritizing enhancements accordingly, instead of solely focusing on tracking <a href=\"\"https://martinfowler.com/bliki/TechnicalDebt.html\"\" target=\"\"_blank\"\" aria-label=\"\"technical debt. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">technical debt<span class=\"\"pop-out-icon\"\"></span></a>. By allocating resources efficiently to address the most impactful issues related to health, teams and organizations can reduce long-term maintenance costs and evolve products more efficiently. This approach also enhances communication between technical and nontechnical stakeholders, fostering a common understanding of the system's state. Although metrics may vary among organizations (see this <a href=\"\"https://www.rea-group.com/about-us/news-and-insights/blog/what-good-software-looks-like-at-rea/\"\" target=\"\"_blank\"\" aria-label=\"\"blog post. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">blog post<span class=\"\"pop-out-icon\"\"></span></a> for examples) they ultimately contribute to long-term sustainability and ensure software remains adaptable and competitive. In a rapidly changing digital landscape, focusing on <strong>tracking health over debt</strong> of systems provides a structured and evidence-based strategy to maintain and enhance them.</p>\""
  },
  {
    "name": "Unit testing for alerting rules",
    "ring": "trial",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>Observability and monitoring are essential for software teams. Given the unpredictable nature of certain events, creating accurate alert mechanisms with complex rules is crucial. However, the true validation of these rules comes only when scenarios arise in the wild. The <strong>unit testing for alerting rules</strong> technique allows teams to better define rules by proactively testing and refining them beforehand, increasing confidence in the way the rule is set up. This helps to reduce false alarms and ensure genuine issues are highlighted. Tools like <a href=\"\"https://www.thoughtworks.com/radar/tools/prometheus\"\">Prometheus</a> support <a href=\"\"https://prometheus.io/docs/prometheus/latest/configuration/unit_testing_rules/\"\" target=\"\"_blank\"\" aria-label=\"\"unit testing for rules. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">unit testing for rules<span class=\"\"pop-out-icon\"\"></span></a>; our teams are already reporting its benefits in real-world settings.</p>\""
  },
  {
    "name": "Zero trust security for CI/CD",
    "ring": "trial",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "status": "moved in",
    "description": "\"<p>If not properly secured, the infrastructure and tools that run our build and delivery pipelines can become a big liability. Pipelines need access to critical data and systems like source code, credentials and secrets to build and deploy software. This makes these systems very inviting to malicious actors. We therefore highly recommend applying <strong><a href=\"\"https://www.thoughtworks.com/radar/techniques/zero-trust-architecture\"\">zero trust</a> security for CI/CD</strong> pipelines and infrastructure — trusting them as little as necessary. This encompasses a number of techniques: If available, authenticate your pipelines with your cloud provider via federated identity mechanisms like <a href=\"\"https://www.thoughtworks.com/radar/techniques/oidc-for-github-actions\"\">OIDC</a>, instead of giving them direct access to secrets; implement the principle of least privilege by minimizing the access of individual user or runner accounts, rather than employing \"\"god user accounts\"\" with unlimited access; use your runners in an ephemeral way instead of reusing them, to reduce the risk of exposing secrets from previous jobs or running jobs on compromised runners; keep the software in your agents and runners up to date; and monitor the integrity, confidentiality and availability of your CI/CD systems the same way you would monitor your production software.</p><br><br><p>We're seeing teams forget about these types of practices, particularly when they’re used to working with a self-managed CI/CD infrastructure in internal network zones. While all of these practices are important in your internal networks, they become even more crucial when using a managed service, as that extends the attack surface and blast radius even more.</p>\""
  },
  {
    "name": "Dependency health checks to counter package hallucinations",
    "ring": "assess",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>Securing the software supply chain has become a common concern among delivery teams, reflected in the growing number of tools and techniques in the space, several of which we've covered previously in the Radar. The growing popularity of GenAI-based tools as aids to the software development process has introduced a new software supply chain attack vector: <a href=\"\"https://vulcan.io/blog/ai-hallucinations-package-risk\"\" target=\"\"_blank\"\" aria-label=\"\"package hallucinations. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">package hallucinations<span class=\"\"pop-out-icon\"\"></span></a>. We believe it’s important for teams that use such GenAI tools in their development process to stay vigilant against this risk. To do so, teams can perform <strong>dependency health checks to counter package hallucination</strong>: look at the date it was created, download numbers, comments and stars, the number of contributors, activity history and so on before choosing to adopt. Some of these can be performed on package repositories and GitHub, and tools like <a href=\"\"https://deps.dev/\"\" target=\"\"_blank\"\" aria-label=\"\"deps.dev. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">deps.dev<span class=\"\"pop-out-icon\"\"></span></a> and <a href=\"\"https://snyk.io/advisor/\"\" target=\"\"_blank\"\" aria-label=\"\"Snyk advisor. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Snyk advisor<span class=\"\"pop-out-icon\"\"></span></a> can also provide additional input. Although it's not a new technique, it's gaining renewed relevance as teams increasingly experiment with GenAI tools in their software development process.</p>\""
  },
  {
    "name": "Design system decision records",
    "ring": "assess",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>In a fast-paced product development environment where users' needs constantly evolve, design is an area that is ever-changing. This means input on design decisions will continue to be required. Borrowing from the idea of documenting architecture decisions via ADRs, we started adopting a similar format — <strong>design system decision records</strong> — in order to document design system decisions with the corresponding rationale, research insights and experiment results. Communicating design system decisions effectively seems to be an emerging need of product development teams; doing it in this light manner is also recommended by <a href=\"\"https://zeroheight.com/blog/capturing-your-design-system-decisions/\"\" target=\"\"_blank\"\" aria-label=\"\"zeroheight. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">zeroheight<span class=\"\"pop-out-icon\"\"></span></a>. This technique helped us reduce onboarding times, move conversations forward and align work streams that share the same design system.</p>\""
  },
  {
    "name": "GitOps",
    "ring": "assess",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "status": "moved in",
    "description": "\"<p><strong>GitOps</strong> is a technique for deploying applications via the <a href=\"\"https://kubernetes.io/docs/concepts/architecture/controller/\"\" target=\"\"_blank\"\" aria-label=\"\"control loop. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">control loop<span class=\"\"pop-out-icon\"\"></span></a> pattern. An operator keeps the deployed application synchronized with configuration, usually a Git repository. When we last wrote about GitOps, the community had yet to agree on a definition of the term. At the time, we were concerned about common interpretations of the technique that included approaches like \"\"branch per environment\"\" for configuration, which may lead to <a href=\"\"https://infrastructure-as-code.com/book/2021/11/19/snowflakes-as-code.html\"\" target=\"\"_blank\"\" aria-label=\"\"snowflakes as code. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">snowflakes as code<span class=\"\"pop-out-icon\"\"></span></a>. Moreover, the messaging around GitOps as an alternative to continuous delivery was confusing. Since then, the four <a href=\"\"https://github.com/open-gitops/documents/blob/main/PRINCIPLES.md\"\" target=\"\"_blank\"\" aria-label=\"\"GitOps principles. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">GitOps principles<span class=\"\"pop-out-icon\"\"></span></a> have clarified the scope and nature of the technique. When you peel away the hype and confusion, GitOps is a useful technique that takes advantage of the functionality of a <a href=\"\"https://www.thoughtworks.com/radar/platforms/kubernetes\"\">Kubernetes</a> cluster and creates opportunities to separate concerns between configuring an application and the implementation of the deployment process. Some of our teams have implemented GitOps as part of their continuous delivery setup with positive experiences, which is why we recommend assessing it.</p>\""
  },
  {
    "name": "LLM-powered autonomous agents",
    "ring": "assess",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>As development of large language models continues, interest in building autonomous AI agents is strong. <a href=\"\"https://github.com/Significant-Gravitas/Auto-GPT\"\" target=\"\"_blank\"\" aria-label=\"\"AutoGPT. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">AutoGPT<span class=\"\"pop-out-icon\"\"></span></a>, <a href=\"\"https://github.com/AntonOsika/gpt-engineer\"\" target=\"\"_blank\"\" aria-label=\"\"GPT-Engineer. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">GPT-Engineer<span class=\"\"pop-out-icon\"\"></span></a> and <a href=\"\"https://github.com/yoheinakajima/babyagi\"\" target=\"\"_blank\"\" aria-label=\"\"BabyAGI. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">BabyAGI<span class=\"\"pop-out-icon\"\"></span></a> are all examples of <strong>LLM-powered autonomous agents</strong> that drive an underlying LLM to understand the goal they have been given and to work toward it. The agent remembers how far it has progressed, uses the LLM in order to reason about what to do next, takes actions and understands when the goal has been met. This is often known as chain-of-thought reasoning — and it can actually work. One of our teams implemented a client service chatbot as an autonomous agent. If the bot cannot achieve the customer's goal, it recognizes its own limitation and redirects the customer to a human instead. This approach is definitely early in its development cycle: autonomous agents often suffer from a high failure rate and incur costly AI service fees, and at least one AI startup has <a href=\"\"https://twitter.com/zachtratar/status/1694024240880861571\"\" target=\"\"_blank\"\" aria-label=\"\"pivoted away. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">pivoted away<span class=\"\"pop-out-icon\"\"></span></a> from an agent-based approach.</p>\""
  },
  {
    "name": "Platform orchestration",
    "ring": "assess",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>With the widespread adoption of <a href=\"\"https://www.thoughtworks.com/radar/techniques/platform-engineering-product-teams\"\">platform engineering</a>, we're seeing a new generation of tools that go beyond the traditional platform-as-a-service (PaaS) model and offer published contracts between developers and platform teams. The contract might involve provisioning cloud environments, databases, monitoring, authentication and more in a different environment. These tools enforce organizational standards while granting developers self-service access to variations through configuration. Examples of these <strong>platform orchestration</strong> systems include <a href=\"\"https://kratix.io/\"\" target=\"\"_blank\"\" aria-label=\"\"Kratix. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Kratix<span class=\"\"pop-out-icon\"\"></span></a> and <a href=\"\"https://humanitec.com/products/platform-orchestrator\"\" target=\"\"_blank\"\" aria-label=\"\"Humanitec Platform Orchestrator. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Humanitec Platform Orchestrator<span class=\"\"pop-out-icon\"\"></span></a>. We'd recommend platform teams assess these tools as an alternative to pulling together your own unique collection of scripts, native tools and <a href=\"\"https://www.thoughtworks.com/radar/techniques/infrastructure-as-code\"\">infrastructure as code</a>. We've also noted a similarity to the concepts in the <a href=\"\"https://www.thoughtworks.com/radar/techniques/open-application-model-oam\"\">Open Application Model (OAM)</a> and its reference orchestrator <a href=\"\"https://kubevela.io/\"\" target=\"\"_blank\"\" aria-label=\"\"KubeVela. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">KubeVela<span class=\"\"pop-out-icon\"\"></span></a>, although OAM claims to be more application-centric than workload-centric.</p>\""
  },
  {
    "name": "Self-hosted LLMs",
    "ring": "assess",
    "quadrant": "techniques",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>Large language models (LLMs) generally require significant GPU infrastructure to operate, but there has been a strong push to get them running on more modest hardware. <a href=\"\"https://www.thoughtworks.com/radar/languages-and-frameworks/ggml\"\">Quantization</a> of a large model can reduce memory requirements, allowing a high-fidelity model to run on less expensive hardware or even a CPU. Efforts such as <a href=\"\"https://github.com/ggerganov/llama.cpp\"\" target=\"\"_blank\"\" aria-label=\"\"llama.cpp. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">llama.cpp<span class=\"\"pop-out-icon\"\"></span></a> make it possible to run LLMs on hardware including Raspberry Pis, laptops and commodity servers.</p><br><br><p>Many organizations are deploying <strong>self-hosted LLMs</strong>. This is often due to security or privacy concerns, or, sometimes, a need to run models on edge devices. Open-source examples include <a href=\"\"https://huggingface.co/docs/transformers/model_doc/gptj\"\" target=\"\"_blank\"\" aria-label=\"\"GPT-J. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">GPT-J<span class=\"\"pop-out-icon\"\"></span></a>, <a href=\"\"https://huggingface.co/togethercomputer/GPT-JT-6B-v1\"\" target=\"\"_blank\"\" aria-label=\"\"GPT-JT. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">GPT-JT<span class=\"\"pop-out-icon\"\"></span></a> and <a href=\"\"https://www.thoughtworks.com/radar/tools/llama-2\"\">Llama</a>. This approach offers better control of the model in fine-tuning for a specific use case, improved security and privacy as well as offline access. Although we've helped some of our clients self-host <a href=\"\"https://www.thoughtworks.com/radar/tools/open-source-llms-for-coding\"\">open-source LLMs</a> for code completion, we recommend you carefully assess the organizational capabilities and the cost of running such LLMs before making the decision to self-host.</p>\""
  },
  {
    "name": "Ignoring OWASP Top 10 lists",
    "ring": "hold",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>The <a href=\"\"https://owasp.org/www-project-top-ten/\"\" target=\"\"_blank\"\" aria-label=\"\"OWASP Top 10. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">OWASP Top 10<span class=\"\"pop-out-icon\"\"></span></a> has long been a go-to reference for the most critical security risks to web applications. Despite being well-known, we've previously written about it being underused in the software development process and cautioned against <a href=\"\"https://www.thoughtworks.com/radar/techniques/ignoring-owasp-top-10\"\">ignoring OWASP Top 10</a>.</p><br><br><p>What is less well-known is that OWASP also publishes similar top 10 lists for other categories. The <a href=\"\"https://owasp.org/www-project-top-10-for-large-language-model-applications/\"\" target=\"\"_blank\"\" aria-label=\"\"OWASP Top 10 list for LLMs. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">OWASP Top 10 list for LLMs<span class=\"\"pop-out-icon\"\"></span></a>, whose first major version was released early August, highlights risks such as prompt injection, insecure output handling, training data poisoning and others that individuals and teams building LLM applications would do well to be aware of. OWASP has also recently released the second version of its <a href=\"\"https://owasp.org/API-Security/editions/2023/en/0x00-header/\"\" target=\"\"_blank\"\" aria-label=\"\"OWASP Top 10 list for APIs. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">OWASP Top 10 list for APIs<span class=\"\"pop-out-icon\"\"></span></a>. Given the OWASP Top 10 lists' breadth of coverage (web applications, APIs, LLMs and <a href=\"\"https://owasp.org/www-project-serverless-top-10/\"\" target=\"\"_blank\"\" aria-label=\"\"more. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">more<span class=\"\"pop-out-icon\"\"></span></a>), quality and relevance to the continuously changing security landscape, we extend our previous recommendation to caution teams against <strong>ignoring OWASP Top 10 lists</strong>.</p>\""
  },
  {
    "name": "Web components for SSR web apps",
    "ring": "hold",
    "quadrant": "techniques",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>Since we first mentioned them in 2014, <a href=\"\"https://www.thoughtworks.com/radar/platforms/web-components-standard\"\">web components</a> have become popular, and, on the whole, our experience has been positive. Similarly, we've voiced our support for rendering HTML on the server by cautioning against <a href=\"\"https://www.thoughtworks.com/radar/techniques/spa-by-default\"\">SPA by default</a> and by including frameworks such as <a href=\"\"https://www.thoughtworks.com/radar/languages-and-frameworks/next-js\"\">Next.js</a> and <a href=\"\"https://www.thoughtworks.com/radar/languages-and-frameworks/htmx\"\">htmx</a> in addition to traditional server-side frameworks. However, although it’s possible to combine both, it can also prove deeply problematic; that’s why we suggest avoiding <strong>web components for server-side-rendered (SSR) web apps</strong>. As a browser technology, it's not trivial to use web components on the server. Frameworks have sprung up to make this easier, sometimes even using a browser engine, but the complexity is still there. Worse than the issues with developer experience is the user experience: Page load performance is impacted when custom web components have to be loaded and hydrated in the browser, and even with pre-rendering and careful tweaking of the component, a \"\"flash of unstyled content\"\" or some layout shifting is all but unavoidable. The decision to forgo web components can have far-reaching consequences as one of our teams experienced when they had to move their design system away from the web components–based <a href=\"\"https://www.thoughtworks.com/radar/languages-and-frameworks/stencil\"\">Stencil</a>.</p>\""
  },
  {
    "name": "Colima",
    "ring": "adopt",
    "quadrant": "platforms",
    "isNew": "FALSE",
    "status": "moved in",
    "description": "\"<p><strong><a href=\"\"https://github.com/abiosoft/colima\"\" target=\"\"_blank\"\" aria-label=\"\"Colima. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Colima<span class=\"\"pop-out-icon\"\"></span></a></strong> is now our go-to alternative to Docker Desktop on macOS. We continue to use it on several projects to provision the Docker container run time in a <a href=\"\"https://github.com/lima-vm/lima\"\" target=\"\"_blank\"\" aria-label=\"\"Lima VM. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Lima VM<span class=\"\"pop-out-icon\"\"></span></a>, to configure the Docker CLI on macOS and to handle port-forwarding and volume mounts. Colima can be configured to run <a href=\"\"https://containerd.io/\"\" target=\"\"_blank\"\" aria-label=\"\"containerd. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">containerd<span class=\"\"pop-out-icon\"\"></span></a> as its run time, which is also the run time on most managed <a href=\"\"https://www.thoughtworks.com/radar/platforms/kubernetes\"\">Kubernetes</a> services, improving the important dev-prod parity.</p>\""
  },
  {
    "name": "CloudEvents",
    "ring": "trial",
    "quadrant": "platforms",
    "isNew": "FALSE",
    "status": "moved in",
    "description": "\"<p>Events are common mechanisms in event-driven architecture or <a href=\"\"https://www.thoughtworks.com/radar/techniques/serverless-architecture\"\">serverless</a> applications. However, producers or cloud providers tend to support them in different forms, which prevents interoperability across platforms and infrastructures. <strong><a href=\"\"https://cloudevents.io/\"\" target=\"\"_blank\"\" aria-label=\"\"CloudEvents. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">CloudEvents<span class=\"\"pop-out-icon\"\"></span></a></strong> is a specification for describing event data in common formats to provide interoperability across services, platforms and systems. It provides SDKs in multiple languages so you can embed the spec into your application or toolchain. Our teams use it not only for cross-cloud platform purposes but also for domain event specification, among other scenarios. CloudEvents is hosted by the <a href=\"\"https://www.cncf.io/\"\" target=\"\"_blank\"\" aria-label=\"\"Cloud Native Computing Foundation. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Cloud Native Computing Foundation<span class=\"\"pop-out-icon\"\"></span></a> (CNCF) and now runs as an incubator project that has been gaining increasing industry attention.</p>\""
  },
  {
    "name": "DataOps.live",
    "ring": "trial",
    "quadrant": "platforms",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p><strong><a href=\"\"https://www.dataops.live/\"\" target=\"\"_blank\"\" aria-label=\"\"DataOps.live. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">DataOps.live<span class=\"\"pop-out-icon\"\"></span></a></strong> is a data platform that automates environments in <a href=\"\"https://www.thoughtworks.com/radar/platforms/snowflake\"\">Snowflake</a>. Inspired by <a href=\"\"https://www.thoughtworks.com/radar/techniques/devops\"\">DevOps</a> practices, DataOps.live lets you treat the data platform like any other web platform by embracing continuous integration and continuous delivery (CI/CD), automated testing, observability and code management. Our teams are using it for managing the lifecycle of data products that includes development, branching and deployment of both code and data. With its automated <a href=\"\"https://docs.dataops.live/docs/environment-management/\"\" target=\"\"_blank\"\" aria-label=\"\"environment management. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">environment management<span class=\"\"pop-out-icon\"\"></span></a>, it's very easy to build environments based on feature branches, modify them and destroy them automatically. It’s also worth noting its declarative specification (<a href=\"\"https://docs.dataops.live/docs/guides/sole-fundamentals/why-sole/\"\" target=\"\"_blank\"\" aria-label=\"\"SOLE. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">SOLE<span class=\"\"pop-out-icon\"\"></span></a>) capability, which enables a streamlined developer experience. This allows teams to reduce the time it takes to build data products from months to days. Our teams have been using DataOps.live successfully in production, and that's why we recommend this platform when working with Snowflake.</p>\""
  },
  {
    "name": "Google Cloud Vertex AI",
    "ring": "trial",
    "quadrant": "platforms",
    "isNew": "FALSE",
    "status": "moved in",
    "description": "\"<p>Significant developments have happened in the AI landscape since we first blipped <strong><a href=\"\"https://cloud.google.com/vertex-ai\"\" target=\"\"_blank\"\" aria-label=\"\"Google Cloud Vertex AI. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Google Cloud Vertex AI<span class=\"\"pop-out-icon\"\"></span></a></strong>. Since May 2023, Google has introduced several services and features to enrich this realm. These additions include <a href=\"\"https://cloud.google.com/model-garden\"\" target=\"\"_blank\"\" aria-label=\"\"Model Garden. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Model Garden<span class=\"\"pop-out-icon\"\"></span></a>, a repository of 100+ pre-trained models; <a href=\"\"https://cloud.google.com/generative-ai-studio\"\" target=\"\"_blank\"\" aria-label=\"\"Generative AI Studio. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Generative AI Studio<span class=\"\"pop-out-icon\"\"></span></a>, a console intended to rapidly explore and prototype generative AI models; and Vertex AI Extensions which provides fully managed developer tools to connect AI models and real-time data or actions via APIs. The platform has evolved to offer GenAI models and integration support, and we’re excited to use it more extensively.</p>\""
  },
  {
    "name": "Immuta",
    "ring": "trial",
    "quadrant": "platforms",
    "isNew": "FALSE",
    "status": "moved in",
    "description": "\"<p>Since we last wrote about <strong><a href=\"\"https://www.immuta.com/\"\" target=\"\"_blank\"\" aria-label=\"\"Immuta. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Immuta<span class=\"\"pop-out-icon\"\"></span></a></strong>, our teams have gained significant experience with this data security platform. Its highlights include the ability to define subscription and data policies as code, version control and the ability to deploy these policies automatically to higher environments. Its <a href=\"\"https://en.wikipedia.org/wiki/Attribute-based_access_control\"\" target=\"\"_blank\"\" aria-label=\"\"ABAC. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">ABAC<span class=\"\"pop-out-icon\"\"></span></a> support allows us to associate tags to data sources; if the same tag is associated with the user, access is granted. By leveraging Immuta and <a href=\"\"https://www.thoughtworks.com/radar/platforms/snowflake\"\">Snowflake</a> integration we've been able to automate granting access to data products or data sets in a self-serve fashion. When the \"\"user\"\" requests access to a data product or a data set, the data product tag is then associated with the \"\"user\"\" as an attribute upon approval. Since the attribute on the \"\"user\"\" matches the tag on the data source, access is granted automatically courtesy of Immuta's <a href=\"\"https://documentation.immuta.com/SaaS/writing-global-policies-for-compliance/global-policy-builder/subscription-policy-tutorial/\"\" target=\"\"_blank\"\" aria-label=\"\"Global Subscription policy. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Global Subscription policy<span class=\"\"pop-out-icon\"\"></span></a>. It's also worth noting Immuta's data <a href=\"\"https://documentation.immuta.com/2.8/policies/policies-explained/\"\" target=\"\"_blank\"\" aria-label=\"\"masking policies. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">masking policies<span class=\"\"pop-out-icon\"\"></span></a> which preserve data privacy by masking and restricting PII information to a specific user. Additional access to sensitive information at a much more granular level can be defined using row-level security policies that ensure users only have access to the specific data they're authorized to view. We've been happy with Immuta which is why we’re moving it to Trial — it provides a good developer experience and makes it easier for large organizations to manage data policies.</p>\""
  },
  {
    "name": "Lokalise",
    "ring": "trial",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://lokalise.com\"\" target=\"\"_blank\"\" aria-label=\"\"Lokalise. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Lokalise<span class=\"\"pop-out-icon\"\"></span></a></strong> is a fully automated localization platform that allows for context-specific translations. Our teams use the Lokalise API in their ETL pipelines or development workflows to translate localizable information. Lokalise supports multiple file <a href=\"\"https://developers.lokalise.com/reference/api-file-formats\"\" target=\"\"_blank\"\" aria-label=\"\"formats. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">formats<span class=\"\"pop-out-icon\"\"></span></a> for the localizable strings. One aspect to highlight is the ability to upload an entire file, where each key-value pair is treated as a separate record and translated. Under the hood we leveraged Lokalise's integration with <a href=\"\"https://docs.lokalise.com/en/articles/5166158-machine-translation\"\" target=\"\"_blank\"\" aria-label=\"\"Google MT. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Google MT<span class=\"\"pop-out-icon\"\"></span></a> to take care of the translations. The Lokalise web UI provides ease of access to human reviewers to verify the translations, shorten them and rephrase them as they deem fit. In the past we've highlighted similar tools such as <a href=\"\"https://www.thoughtworks.com/radar/tools/phrase\"\">Phrase</a>. Our teams have had a good experience with Lokalise, and we recommend you evaluate the platform for collaborative translation workflows.</p>\""
  },
  {
    "name": "Orca",
    "ring": "trial",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://orca.security/\"\" target=\"\"_blank\"\" aria-label=\"\"Orca. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Orca<span class=\"\"pop-out-icon\"\"></span></a></strong> is a proprietary cloud security platform that identifies, prioritizes and remediates security risks and compliance issues. It supports major cloud providers and hybrid setups. Orca has extensive security queries/rules to continuously monitor deployed workloads for misconfigurations, vulnerabilities and compliance issues. It supports cloud VMs, serverless functions, containers and <a href=\"\"https://www.thoughtworks.com/radar/platforms/kubernetes\"\">Kubernetes</a> applications for the deployed workloads. These inbuilt security rules are consistently updated to keep pace with the evolving compliance standards and threat vectors. Since Orca is agentless, it offers a good developer experience and is easy to set up. Another notable feature is that it facilitates shift left security. Our teams use <a href=\"\"https://github.com/orcasecurity/orca-cli\"\" target=\"\"_blank\"\" aria-label=\"\"Orca CLI. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Orca CLI<span class=\"\"pop-out-icon\"\"></span></a> for scanning container images and IaC templates for vulnerabilities and misconfigurations as a pre-commit hook or as part of CI/CD workflows. It also continuously monitors and scans container registries (e.g., AWS ECR) for vulnerable base images or weak OS dependencies for already published images. Based on our teams’ experiences, Orca provides a unified view of the security posture across the path to production, and for that reason we place it in Trial.</p>\""
  },
  {
    "name": "Trino",
    "ring": "trial",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://trino.io/\"\" target=\"\"_blank\"\" aria-label=\"\"Trino. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Trino<span class=\"\"pop-out-icon\"\"></span></a></strong>, previously known as PrestoSQL, is an open-source, distributed SQL query engine designed for interactive analytic queries over big data. It is optimized to run both on-premise and in the cloud. It supports querying data where it lives, including Hive, Cassandra, relational databases and even proprietary data stores. For authentication mechanisms, it supports password-based authentication, LDAP and OAuth. For authorization and access control, Trino provides the ability to grant access at the catalog, schema and table levels. Our teams used resource groups spliced according to consumption patterns like visualization, reporting or machine learning use cases to manage and limit resource usage. The JMX-based monitoring provides a rich set of metrics to enable cost attribution at query or user level. Our teams use Trino as a gateway for data access across a variety of sources. When it comes to querying extremely large-scale data, Trino is a safe bet for our teams. <a href=\"\"https://www.thoughtworks.com/radar/platforms/presto\"\">Presto</a>, the <a href=\"\"https://trino.io/blog/2020/12/27/announcing-trino.html\"\" target=\"\"_blank\"\" aria-label=\"\"Facebook project. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Facebook project<span class=\"\"pop-out-icon\"\"></span></a> from which Trino originates, was first featured in the Radar in November 2015.</p>\""
  },
  {
    "name": "ActivityPub",
    "ring": "assess",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>With the current upheaval in the micro-blogging platform space, the <strong><a href=\"\"https://www.w3.org/TR/activitypub/\"\" target=\"\"_blank\"\" aria-label=\"\"ActivityPub. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">ActivityPub<span class=\"\"pop-out-icon\"\"></span></a></strong> protocol is gaining prominence. ActivityPub is an open protocol for sharing information such as posts, publications and dates. It can be used to implement a social media platform, but the key benefit is that it delivers interoperability between different social media platforms. We expect ActivityPub will play a significant role in this space, but we're mentioning it here because we're intrigued by the possibilities beyond the obvious use cases in social media. An example is ActivityPub support for merge requests, recently <a href=\"\"https://gitlab.com/groups/gitlab-org/-/epics/11247\"\" target=\"\"_blank\"\" aria-label=\"\"proposed for GitLab. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">proposed for GitLab<span class=\"\"pop-out-icon\"\"></span></a>.</p>\""
  },
  {
    "name": "Azure Container Apps",
    "ring": "assess",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://azure.microsoft.com/en-us/products/container-apps\"\" target=\"\"_blank\"\" aria-label=\"\"Azure Container Apps. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Azure Container Apps<span class=\"\"pop-out-icon\"\"></span></a></strong> is a managed <a href=\"\"https://www.thoughtworks.com/radar/platforms/kubernetes\"\">Kubernetes</a> namespace as a service that streamlines the deployment of containerized workloads by eliminating the need for intricate maintenance of Kubernetes clusters and underlying infrastructure components, consequently diminishing operational and administrative burdens. However, it’s essential to tread carefully while considering this option; currently in its developmental phase, it has exhibited inconsistencies in the Azure portal's representation of its capabilities and encounters integration hurdles, particularly with the standard Terraform provider for Azure lagging in mirroring the tool's actual functionalities. Given all this, we recommend assessing this tool carefully.</p>\""
  },
  {
    "name": "Azure OpenAI Service",
    "ring": "assess",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>With the huge interest in generative AI, many solutions have sprung up to access the major models. If considering or already using Azure, then it's worth assessing <strong><a href=\"\"https://azure.microsoft.com/en-us/products/ai-services/openai-service/\"\" target=\"\"_blank\"\" aria-label=\"\"Azure OpenAI Service. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Azure OpenAI Service<span class=\"\"pop-out-icon\"\"></span></a></strong>. It provides access to OpenAI's GPT-4, GPT-35-Turbo and Embeddings models through a REST API, a Python SDK and a web-based interface. The models can be adapted to tasks such as content generation, summarization, semantic search and natural language to code translation. Fine-tuning is also available via few-shot learning and the customization of hyperparameters. In comparison to OpenAI's own API, Azure OpenAI Service benefits from Azure's enterprise-grade security and compliance features; it's also available in more regions, although <a href=\"\"https://azure.microsoft.com/en-us/explore/global-infrastructure/products-by-region/?regions=all&amp;products=cognitive-services\"\" target=\"\"_blank\"\" aria-label=\"\"availability is limited. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">availability is limited<span class=\"\"pop-out-icon\"\"></span></a> for each of the larger geographic regions, and, as of writing, India is not included.</p>\""
  },
  {
    "name": "ChatGLM",
    "ring": "assess",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>There are many emerging large language models (LLMs) in the English-speaking world. Although these models are usually pretrained with multiple languages, their performance in other languages may not be as good as in English. <strong><a href=\"\"https://github.com/THUDM/ChatGLM2-6B\"\" target=\"\"_blank\"\" aria-label=\"\"ChatGLM. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">ChatGLM<span class=\"\"pop-out-icon\"\"></span></a></strong>, developed by Tsinghua University, is an open bilingual language model optimized for Chinese conversation based on the <a href=\"\"https://arxiv.org/abs/2103.10360\"\" target=\"\"_blank\"\" aria-label=\"\"General Language Model. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">General Language Model<span class=\"\"pop-out-icon\"\"></span></a> architecture. Since Chinese can be more complex than English with its different word segmentation and grammar, it’s important to have an LLM optimized for Chinese. Our team found ChatGLM beat other LLMs in accuracy and robustness when we built a Chinese emotion detection application for a call center. Considering many LLMs aren’t available in China due to licensing or regional restrictions, ChatGLM became one of the few open-source options.</p>\""
  },
  {
    "name": "Chroma",
    "ring": "assess",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://www.trychroma.com/\"\" target=\"\"_blank\"\" aria-label=\"\"Chroma. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Chroma<span class=\"\"pop-out-icon\"\"></span></a></strong> is an open-source vector store and embedding database, useful for enhancing applications powered by large language models (LLMs) by facilitating the storage and utilization of domain knowledge in LLMs, which typically lack internal memory. Particularly in text-to-text applications, Chroma can automate the intricate process of generating word embeddings and analyzing similarities between them and query embeddings, thereby considerably streamlining operations. It also gives you the option to store custom embeddings, fostering a blend of automation and customization. In light of its capabilities to enhance the functionality of LLM-powered applications, we advise teams to assess Chroma, tapping into its potential to refine the way domain knowledge is integrated into such applications.</p>\""
  },
  {
    "name": "Kraftful",
    "ring": "assess",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>UX research platforms such as <a href=\"\"https://dovetail.com/\"\" target=\"\"_blank\"\" aria-label=\"\"Dovetail. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Dovetail<span class=\"\"pop-out-icon\"\"></span></a> offer organizations a tool to understand and improve their customer experience. With it, businesses are able to quickly and easily gain valuable insights into their customer's needs, preferences and behaviors by collecting and analyzing data from customer feedback, surveys, interviews and more. Sentiment analysis, customer segmentation, market research or data analysis and insight generation are valuable tasks in product development — these  match what LLMs are good at, hence we see a great potential for disruption in the product development field.</p><br><br><p><strong><a href=\"\"https://www.kraftful.com/\"\" target=\"\"_blank\"\" aria-label=\"\"Kraftful. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Kraftful<span class=\"\"pop-out-icon\"\"></span></a></strong> — a self-described copilot for product builders — has taken the lead. It's only in beta and you must provide your email to access the feature list. We've played with it and seen great results. You can plug more than 30 sources of user feedback into the platform and it will analyze the data and identify feature requests, common complaints, what users love about the product and even name your competitors. To gather more details, you can ask questions like you would to <a href=\"\"https://www.thoughtworks.com/radar/tools/chatgpt\"\">ChatGPT</a> or <a href=\"\"https://www.thoughtworks.com/radar/tools/google-bard\"\">Google Bard</a> — the benefit here is it's optimized for your data. Once you prioritize what will be addressed from the user's feedback, Kraftful generates user stories for you based on all underlying data — including acceptance criteria — making it a great assistant to even very experienced product managers and business analysts.</p>\""
  },
  {
    "name": "Pinecone",
    "ring": "assess",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://www.pinecone.io/\"\" target=\"\"_blank\"\" aria-label=\"\"Pinecone. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Pinecone<span class=\"\"pop-out-icon\"\"></span></a></strong> is a fully managed, developer-friendly and cloud-native vector database with a simple API and no infrastructure hassles. Pinecone serves filtered query results with low latency at the scale of billions of vectors. Our teams have found vendor databases and Pinecone in particular very helpful and quick to get started for use cases like storing a team’s knowledge base or help desk portal content rather than fine-tuning complex LLMs.</p>\""
  },
  {
    "name": "wazero",
    "ring": "assess",
    "quadrant": "platforms",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><a href=\"\"https://github.com/tetratelabs/wazero\"\" target=\"\"_blank\"\" aria-label=\"\"wazero. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\"><strong>wazero</strong><span class=\"\"pop-out-icon\"\"></span></a> is a zero dependency <a href=\"\"https://www.thoughtworks.com/radar/languages-and-frameworks/webassembly\"\">WebAssembly</a> (WASM) run time written in Go. Although the run time itself is language neutral, we wanted to highlight wazero for Go developers because it offers a convenient way to <a href=\"\"https://github.com/tetratelabs/wazero/tree/main/examples/basic\"\" target=\"\"_blank\"\" aria-label=\"\"extend. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">extend<span class=\"\"pop-out-icon\"\"></span></a> your Go programs with WASM modules written in any <a href=\"\"https://github.com/appcypher/awesome-wasm-langs\"\" target=\"\"_blank\"\" aria-label=\"\"conformant languages. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">conformant languages<span class=\"\"pop-out-icon\"\"></span></a>. It has no dependency on CGO, so you can easily cross compile your Go applications to other platforms. Although you have a choice when it comes to <a href=\"\"https://github.com/appcypher/awesome-wasm-runtimes\"\" target=\"\"_blank\"\" aria-label=\"\"run times for WASM. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">run times for WASM<span class=\"\"pop-out-icon\"\"></span></a>, we think wazero is worth assessing.</p>\""
  },
  {
    "name": "Mermaid",
    "ring": "adopt",
    "quadrant": "tools",
    "isNew": "FALSE",
    "status": "moved in",
    "description": "\"<p><a href=\"\"https://mermaid.js.org/\"\" target=\"\"_blank\"\" aria-label=\"\"Mermaid. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\"><strong>Mermaid</strong><span class=\"\"pop-out-icon\"\"></span></a> lets you generate diagrams from a Markdown-like markup language. Since we last featured it in the Radar, Mermaid has added support for many more diagrams and <a href=\"\"https://mermaid.js.org/ecosystem/integrations.html\"\" target=\"\"_blank\"\" aria-label=\"\"integrations. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">integrations<span class=\"\"pop-out-icon\"\"></span></a> with source code repositories, IDEs and knowledge management tools. Notably, it's supported natively in popular source code repositories such as GitHub and GitLab, enabling the embedding of and easy updates to Mermaid diagrams in the middle of Markdown documentation. Many of our teams gravitate toward Mermaid as their diagram-as-code tool due to its ease of use, multitude of integrations and wide variety of supported diagram types that keep growing.</p>\""
  },
  {
    "name": "Ruff",
    "ring": "adopt",
    "quadrant": "tools",
    "isNew": "FALSE",
    "status": "moved in",
    "description": "\"<p><strong><a href=\"\"https://github.com/charliermarsh/ruff\"\" target=\"\"_blank\"\" aria-label=\"\"Ruff. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Ruff<span class=\"\"pop-out-icon\"\"></span></a></strong> is a relatively new linter for Python. When it comes to linters, for us the question is not whether to use a linter but which linter to use. Ruff stands out for its out-of-box experience and its speed. It has more than 500 built-in rules and readily replaces Flake8, including many of that linter's plugins. The Ruff team’s claims about its performance are borne out by our experience; it really is at least an order of magnitude faster than other linters which is a huge benefit, because it helps reduce build times on large codebases. For these reasons, Ruff has become our default choice as a Python linter.</p>\""
  },
  {
    "name": "Snyk",
    "ring": "adopt",
    "quadrant": "tools",
    "isNew": "FALSE",
    "status": "moved in",
    "description": "\"<p><strong><a href=\"\"https://snyk.io/\"\" target=\"\"_blank\"\" aria-label=\"\"Snyk. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Snyk<span class=\"\"pop-out-icon\"\"></span></a></strong> provides both static application security testing (SAST) and software component analysis (SCA) tests to help you find, fix and monitor security issues throughout the software development lifecycle. Its broad range of features is designed to speed up the feedback loop, favoring a shift-left approach instead of the <a href=\"\"https://www.thoughtworks.com/radar/techniques/security-sandwich\"\">security sandwich</a> anti-pattern. As one of the best security platforms available today, Snyk stands out because of its ability to identify a wider range of issues, enabled mainly by a <a href=\"\"https://docs.snyk.io/scan-application-code/snyk-open-source/starting-to-fix-vulnerabilities/using-the-snyk-vulnerability-database\"\" target=\"\"_blank\"\" aria-label=\"\"dedicated research team adding to its vulnerability database. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">dedicated research team adding to its vulnerability database<span class=\"\"pop-out-icon\"\"></span></a>. But there’s room for improvement: the dashboard currently doesn't provide an easy way to filter noise down to specific actionable information; depending on the language ecosystem, SCA-based integrations can output false positives compared to pipeline-based integrations because Snyk has to guess what the resolved dependencies are; automated resolution is not consistently successful; and significant integration investment is required in order to achieve proper gatekeeping or to establish an <a href=\"\"https://www.thoughtworks.com/radar/techniques/software-bill-of-materials\"\">SBOM</a> in high regulatory environments. Despite these shortcomings, many of our enterprise clients have adopted Snyk; we too are using it for our IT function.</p>\""
  },
  {
    "name": "AWS Control Tower",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>Multi-team account management is a challenge in AWS, especially in setup and governance. <strong><a href=\"\"https://aws.amazon.com/controltower\"\" target=\"\"_blank\"\" aria-label=\"\"AWS Control Tower. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">AWS Control Tower<span class=\"\"pop-out-icon\"\"></span></a></strong> addresses this challenge by simplifying setup and automating governance; it addresses regulatory requirements with guardrails. AWS Control Tower has a built-in Account Factory that helps automate the account provisioning workflow. Among other things, you can update, unmanage and close accounts that you create and provision through Account Factory. Due to its lack of automation and customization, Amazon introduced <a href=\"\"https://github.com/aws-ia/terraform-aws-control_tower_account_factory\"\" target=\"\"_blank\"\" aria-label=\"\"AWS Control Tower Account Factory for Terraform (AFT). This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">AWS Control Tower Account Factory for Terraform (AFT)<span class=\"\"pop-out-icon\"\"></span></a>. AFT allows you to provision customizations to send webhooks or take specific actions that allow for the integration with other tools to kick off jobs as part of the account creation process. One of the use cases leveraged by our team was to manage a set of out-of-the box items for accounts that were set-and-forget configurations for baselining and creating access for roles for <a href=\"\"https://www.thoughtworks.com/radar/platforms/github-actions\"\">GitHub Actions</a>. This resulted in providing developers with an account that’s security baselined with a fully integrated VPC, ready to receive workload via GitHub Actions. Our teams have reported great results using AWS Control Tower to manage accounts, as a single access control for multiple teams, and with leveraging AFT in their workloads.</p>\""
  },
  {
    "name": "cdk-nag",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://github.com/cdklabs/cdk-nag\"\" target=\"\"_blank\"\" aria-label=\"\"cdk-nag. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">cdk-nag<span class=\"\"pop-out-icon\"\"></span></a></strong> identifies and reports security and compliance issues in <a href=\"\"https://www.thoughtworks.com/radar/platforms/aws-cloud-development-kit\"\">AWS CDK</a> applications or CloudFormation templates. It comes with several so-called <a href=\"\"https://github.com/cdklabs/cdk-nag/blob/main/RULES.md\"\" target=\"\"_blank\"\" aria-label=\"\"packs of rules. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">packs of rules<span class=\"\"pop-out-icon\"\"></span></a>: a general AWS pack that includes checks for what AWS considers best practices, as well as packs for HIPAA, NIST, and PCI compliance. You can add additional rules as needed. Rules can result in either warnings or errors, both of which are included in reports generated by the tool. When errors are present, the <code>cdk deploy</code> command will not do deployments. If the cause of the error can't be fixed in time, you can still deploy with the error present but suppressed. Obviously, this should only be done in exceptional cases.</p>\""
  },
  {
    "name": "Checkov",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://www.checkov.io/\"\" target=\"\"_blank\"\" aria-label=\"\"Checkov. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Checkov<span class=\"\"pop-out-icon\"\"></span></a></strong> is a specialized static security scanner for <a href=\"\"https://www.thoughtworks.com/radar/techniques/infrastructure-as-code\"\">infrastructure as code (IaC)</a>. It supports a broad array of infra languages, including <a href=\"\"https://www.thoughtworks.com/radar/platforms/kubernetes\"\">Kubernetes</a> manifests, <a href=\"\"https://www.thoughtworks.com/radar/tools/helm\"\">Helm</a> charts, CloudFormation templates and <a href=\"\"https://www.thoughtworks.com/radar/tools/terraform\"\">Terraform</a>. Easily deployable in CI/CD pipelines, it safeguards against potential security gaps in diverse cloud infrastructure configurations. Leveraging a set of default rules, it identifies common security scenarios with detailed remediation advice available on its website. Checkov supports custom rules and uses YAML for simple guideline definitions or Python for crafting more complex ones. Our teams have successfully used Checkov to enhance security during infrastructure deployments, appreciating the early warnings it provides on potential issues before deployment.</p>\""
  },
  {
    "name": "Chromatic",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://www.chromatic.com/features/test\"\" target=\"\"_blank\"\" aria-label=\"\"Chromatic. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Chromatic<span class=\"\"pop-out-icon\"\"></span></a></strong> is a visual regression testing tool to help catch UI regression in web applications. It works by taking snapshots of UI components and comparing them against previous snapshots when they change. It's a hosted service that integrates with popular cloud code hosting services. Built on top of <a href=\"\"https://storybook.js.org/\"\" target=\"\"_blank\"\" aria-label=\"\"Storybook. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Storybook<span class=\"\"pop-out-icon\"\"></span></a>, it does <a href=\"\"https://www.thoughtworks.com/radar/techniques/component-visual-regression-testing\"\">component-level visual regression testing</a>. It can render the components in different viewport widths for responsive testing and integrates with CI workflows, generating the UI changeset for every commit, which makes it easy to review. Our teams find the visual difference between Chromatic and other tools in this space much better; the ability to highlight changes visually makes it particularly useful.</p>\""
  },
  {
    "name": "Cilium",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "FALSE",
    "status": "moved in",
    "description": "\"<p><a href=\"\"https://www.thoughtworks.com/radar/platforms/ebpf\"\">eBPF</a> is famous for its application transparency, high performance and low overhead. ​T​hus the cloud-native community has been exploring its use case for <a href=\"\"https://www.thoughtworks.com/radar/techniques/service-mesh-without-sidecar\"\">service mesh without sidecar</a>. <strong><a href=\"\"https://cilium.io/\"\" target=\"\"_blank\"\" aria-label=\"\"Cilium. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Cilium<span class=\"\"pop-out-icon\"\"></span></a></strong> is an open-source project that provides networking, security and observability for cloud-native environments such as Kubernetes clusters and other container orchestration platforms. It provides a simple flat Layer 3 network to routing or overlay and is L7 protocol aware. By decoupling security from addressing, Cilium could play a significant role as a new network protection layer. We've seen the adoption of Cilium among some cloud providers and have also used it in Thoughtworks projects. The community is still <a href=\"\"https://www.infoq.com/articles/ebpf-service-mesh/\"\" target=\"\"_blank\"\" aria-label=\"\"discussing. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">discussing<span class=\"\"pop-out-icon\"\"></span></a> whether eBPF can replace sidecar, but there appears to be consensus that some mesh features cannot or should not be executed in the kernel. In addition, applying Cilium also requires eBPF-related experience. Based on the positive results in our project, we recommend you try this technology yourself.</p>\""
  },
  {
    "name": "Cloud Carbon Footprint",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p><strong><a href=\"\"https://www.cloudcarbonfootprint.org/\"\" target=\"\"_blank\"\" aria-label=\"\"Cloud Carbon Footprint. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Cloud Carbon Footprint<span class=\"\"pop-out-icon\"\"></span></a></strong> (CCF) is an open-source tool that estimates carbon emissions for cloud workloads across the major cloud service providers. It queries cloud APIs for resource usage data and uses multiple sources to track carbon emissions. Following a published methodology, CCF combines these into emission estimates and provides a visualization of the data over time. Cloud providers have started adding similar offerings to their platforms, but <a href=\"\"https://www.thoughtworks.com/clients/Bringing-green-cloud-optimization-to-a-green-energy-business\"\">organizations</a> are still deploying CCF because it has all of the following features: It's open-source, designed to be extended, works across multiple clouds and has a transparent, published methodology. In addition, it also includes estimates for scope 2 and scope 3 emissions — for electricity use and hardware production, respectively. In our experiments, the estimates between different tools have varied, which is not a huge surprise given that all tools in this space make estimates and multiply estimated numbers. However, settling on one tool, taking a baseline and improving from that baseline is the key usage scenario we've come across, and tools like <a href=\"\"https://www.thoughtworks.com/radar/tools/kepler\"\">Kepler</a> may reduce the need for estimates in the future. CCF also delivers GCP and AWS-sourced optimization recommendations, which not only help reduce your cloud carbon footprint but can also become part of a wider cloud cost optimization strategy. Thoughtworks is a significant contributor to CCF.</p>\""
  },
  {
    "name": "Container Structure Tests",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://github.com/GoogleContainerTools/container-structure-test\"\" target=\"\"_blank\"\" aria-label=\"\"Container Structure Tests (CST). This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Container Structure Tests (CST)<span class=\"\"pop-out-icon\"\"></span></a></strong> is a tool developed by Google to test the structure of a container image. CST can be used to check the existence or absence of a certain file in the image's file system, to verify the content of a file, to check the output or errors inside a specific command issued in the container and to check the metadata of the container image (i.e., labels, entrypoint and command) which helps ensure compliance with the <a href=\"\"https://www.cisecurity.org/benchmark/docker\"\" target=\"\"_blank\"\" aria-label=\"\"CIS Docker Benchmark. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">CIS Docker Benchmark<span class=\"\"pop-out-icon\"\"></span></a>. We've had good experiences with CST and recommend you give it a try. In addition to preventing vulnerabilities — checking whether the container is exposing unnecessary ports — we also used it to validate that each Docker container passes all requirements necessary for it to be deployed and to run an application in the enterprise's platform. One of these requirements was having an observability agent installed in the image. It's important to be aware that CST isn't officially supported by Google, which could impact maintenance.</p>\""
  },
  {
    "name": "Devbox",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "FALSE",
    "status": "moved in",
    "description": "\"<p><strong><a href=\"\"https://www.jetpack.io/devbox/\"\" target=\"\"_blank\"\" aria-label=\"\"Devbox. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Devbox<span class=\"\"pop-out-icon\"\"></span></a></strong> is a terminal-based tool that provides an approachable interface for creating reproducible, per-project development environments, leveraging the Nix package manager without using virtual machines or containers. Our teams use it to eliminate version and configuration mismatches of CLI tools and custom scripts in their per-project development environments, on top of the standardization that per-language package managers provide. They found that it notably streamlines their onboarding workflow because once it has been configured for a codebase, it takes one CLI command (<code>devbox shell</code>) to stand it up in a new machine. Devbox supports shell hooks, custom scripts and <a href=\"\"https://containers.dev/\"\" target=\"\"_blank\"\" aria-label=\"\"devcontainer.json. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">devcontainer.json<span class=\"\"pop-out-icon\"\"></span></a> generation for integration with VSCode.</p>\""
  },
  {
    "name": "DX DevEx 360",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://getdx.com/products/devex360\"\" target=\"\"_blank\"\" aria-label=\"\"DX DevEx 360. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">DX DevEx 360<span class=\"\"pop-out-icon\"\"></span></a></strong> is a survey-based tool that helps find leading signals of developer productivity by focusing on frictions that developers face in their day-to-day work, such as the code review process, code quality, ability to do deep work and more. The survey is designed by Nicole Forsgren and Margaret-Anne Storey, who have led previous efforts like <a href=\"\"https://cloud.google.com/blog/products/devops-sre/using-the-four-keys-to-measure-your-devops-performance\"\" target=\"\"_blank\"\" aria-label=\"\"DORA. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">DORA<span class=\"\"pop-out-icon\"\"></span></a> and <a href=\"\"https://queue.acm.org/detail.cfm?id=3454124\"\" target=\"\"_blank\"\" aria-label=\"\"SPACE. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">SPACE<span class=\"\"pop-out-icon\"\"></span></a>, among other experts.</p><br><br><p>Our platform engineering teams have used DX DevEx 360 successfully to understand developer sentiment and identify friction points to inform the platform roadmap. Unlike similar tools, with DX DevEx 360 we've received a response rate of 90% or above, often with detailed comments from developers on problems and ideas for improvements. We also appreciate that the tool makes results transparent to engineers in the company instead of just managers and that it enables team-by-team breakdown to enable continuous improvement for each team’s context.</p>\""
  },
  {
    "name": "GitHub Copilot",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "FALSE",
    "status": "moved in",
    "description": "\"<p><strong><a href=\"\"https://github.com/features/copilot\"\" target=\"\"_blank\"\" aria-label=\"\"GitHub Copilot. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">GitHub Copilot<span class=\"\"pop-out-icon\"\"></span></a></strong> is used by many of our teams to help them write code faster. Overall, most of our developers find it very useful and would be cross if we took it away from them. We've been collating and sharing many of our experiences with Copilot through <a href=\"\"https://martinfowler.com/articles/exploring-gen-ai.html\"\" target=\"\"_blank\"\" aria-label=\"\"a series on Generative AI. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">a series on Generative AI<span class=\"\"pop-out-icon\"\"></span></a> and <a href=\"\"https://www.thoughtworks.com/insights/blog/generative-ai/getting-started-with-github-copilot\"\">a guide on getting started with Copilot</a>. Note that GitHub Copilot can be used with any codebase, not just codebases hosted on GitHub.</p><br><br><p>We're also excited that Copilot's chat feature from the <a href=\"\"https://github.com/features/preview/copilot-x\"\" target=\"\"_blank\"\" aria-label=\"\"Copilot X roadmap. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Copilot X roadmap<span class=\"\"pop-out-icon\"\"></span></a> has become more widely available since we last featured it in the Radar. It is a powerful addition to Copilot's in-line assistance feature. The availability of a chat interface inside the IDE improves the discoverability of commonly searched information, and integration with the open editor context makes it easy to explore errors or ask the chat to assist with tasks related to the code in focus.</p>\""
  },
  {
    "name": "Insomnia",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>Since Postman <a href=\"\"https://blog.postman.com/announcing-new-lightweight-postman-api-client/\"\" target=\"\"_blank\"\" aria-label=\"\"announced. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">announced<span class=\"\"pop-out-icon\"\"></span></a> in May 2023 that it would be sunsetting Scratch Pad mode with its offline capabilities, teams that need to keep API workspace data off third-party servers have had to find alternatives. <strong><a href=\"\"https://insomnia.rest/\"\" target=\"\"_blank\"\" aria-label=\"\"Insomnia. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Insomnia<span class=\"\"pop-out-icon\"\"></span></a></strong> is one such alternative: it's a free and open-source desktop application designed for API testing, development and debugging. Although Insomnia supports online syncing, it'll let you keep API workspace data offline. Our teams have found migration from Postman for manual API testing seamless as its features are similar, and it allows importing of Postman collections. Despite our teams' positive experiences with Insomnia, we're keeping an eye on other developing alternatives of various forms — from GUI tools like Insomnia that are drop-in alternatives, to CLI tools like <a href=\"\"https://httpie.io/\"\" target=\"\"_blank\"\" aria-label=\"\"HTTPie. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">HTTPie<span class=\"\"pop-out-icon\"\"></span></a>, to IDE plugins such as <a href=\"\"https://www.thoughtworks.com/radar/tools/intellij-http-client-plugin\"\">IntelliJ HTTP client plugin</a>.</p>\""
  },
  {
    "name": "IntelliJ HTTP Client plugin",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://www.jetbrains.com/help/idea/http-client-in-product-code-editor.html\"\" target=\"\"_blank\"\" aria-label=\"\"IntelliJ HTTP Client plugin. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">IntelliJ HTTP Client plugin<span class=\"\"pop-out-icon\"\"></span></a></strong> allows developers to create, edit and execute HTTP requests inside the code editor, simplifying the development process when building and consuming APIs. It's becoming increasingly popular among our teams, who appreciate its user-friendly features and convenience. Its standout features include support for private files which safeguards sensitive keys by excluding them from git by default, version control and the ability to utilize variables which enhances the developer experience. Given its capacity to streamline developer workflows and bolster security measures, we recommend trying this tool.</p>\""
  },
  {
    "name": "KEDA",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://keda.sh/\"\" target=\"\"_blank\"\" aria-label=\"\"KEDA. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">KEDA<span class=\"\"pop-out-icon\"\"></span></a></strong>, the Kubernetes Event-Driven Autoscaler, does exactly what its name suggests: it enables the scaling of a <a href=\"\"https://www.thoughtworks.com/radar/platforms/kubernetes\"\">Kubernetes</a> cluster in relation to the number of events that must be processed. In our experience, using leading indicators like queue depth — rather than trailing indicators like CPU usage — is preferable. KEDA supports different event sources and comes with a catalog of more than 50 scalers for various cloud platforms, databases, messaging systems, telemetry systems, CI/CD systems and more. Our teams report that the ease with which KEDA can be integrated has allowed them to keep functionality in microservices in Kubernetes where they otherwise might have considered porting some of the event handling code to serverless functions.</p>\""
  },
  {
    "name": "Kubeconform",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://github.com/yannh/kubeconform\"\" target=\"\"_blank\"\" aria-label=\"\"Kubeconform. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Kubeconform<span class=\"\"pop-out-icon\"\"></span></a></strong> is a streamlined tool for validating <a href=\"\"https://www.thoughtworks.com/radar/platforms/kubernetes\"\">Kubernetes</a> manifests and custom resource definitions (CRD). Easily deployable in CI/CD pipelines or local machine setups, it fosters confidence by validating resources prior to deployment, thereby mitigating potential errors. Given its track record in enhancing operational assurance, especially with templated resources shared across teams, we recommend trialing Kubeconform to bolster the security and efficiency of your resource validation processes.</p>\""
  },
  {
    "name": "mob",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "FALSE",
    "status": "moved in",
    "description": "\"<p><strong><a href=\"\"https://github.com/remotemobprogramming/mob\"\" target=\"\"_blank\"\" aria-label=\"\"mob. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">mob<span class=\"\"pop-out-icon\"\"></span></a></strong> is a command-line tool for seamless <a href=\"\"https://www.remotemobprogramming.org/#git-handover\"\" target=\"\"_blank\"\" aria-label=\"\"git handover. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">git handover<span class=\"\"pop-out-icon\"\"></span></a> in remote pair or <a href=\"\"https://www.thoughtworks.com/radar/techniques/remote-mob-programming\"\">mob programming</a>. It hides all the version control paraphernalia behind a command-line interface that makes participating in mob programming sessions simpler. It also provides specific advice around how to participate remotely, for example, to \"\"steal the screenshare\"\" in Zoom rather than ending a screenshare, ensuring the video layout doesn't change for participants. Several of our teams highly recommend mob, and it has become an integral part of our toolchain in remote pair or mob programming.</p>\""
  },
  {
    "name": "MobSF",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://github.com/MobSF/Mobile-Security-Framework-MobSF\"\" target=\"\"_blank\"\" aria-label=\"\"MobSF. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">MobSF<span class=\"\"pop-out-icon\"\"></span></a></strong> is an open-source, automated static and dynamic security testing tool for detecting security vulnerabilities in iOS and Android mobile apps. It scans both app sources and binaries and provides detailed reports about vulnerabilities. MobSF is distributed as Docker images and comes with easy-to-use REST APIs and, via <a href=\"\"https://github.com/MobSF/mobsfscan\"\" target=\"\"_blank\"\" aria-label=\"\"mobsfscan. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">mobsfscan<span class=\"\"pop-out-icon\"\"></span></a>, can be integrated into CI/CD pipelines. Our experience using MobSF for security testing Android apps has been positive; we recommend trying it for your mobile app security testing needs.</p>\""
  },
  {
    "name": "Mocks Server",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://www.mocks-server.org/\"\" target=\"\"_blank\"\" aria-label=\"\"Mocks Server. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Mocks Server<span class=\"\"pop-out-icon\"\"></span></a></strong> is a Node.js-based API mocking tool valued by our teams for its ability to replicate intricate API responses, headers and status codes. The dynamic response generation supports the simulation of diverse scenarios, which allows for the rigorous testing of API interactions. Mocks can be described as YAML or JSON and managed through the CLI, REST API or JavaScript code. Mocks Server's features include request matching, proxying and record-playback features, which facilitate the emulation of realistic API interactions. We particularly like the integration with Docker containers, which makes it easy to deploy the server consistently between environments so it can be versioned and maintained as another artifact of the ecosystem. Its straightforward approach aligns with our emphasis on simplicity and efficiency in development processes. We look forward to using Mocks Server more extensively as our testing strategy evolves along with our solutions.</p>\""
  },
  {
    "name": "Prisma runtime defense",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://docs.paloaltonetworks.com/prisma/prisma-cloud/prisma-cloud-admin-compute/runtime_defense\"\" target=\"\"_blank\"\" aria-label=\"\"Prisma runtime defense. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Prisma runtime defense<span class=\"\"pop-out-icon\"\"></span></a></strong>, which is a part of the Prisma Cloud suite, offers a new approach to container security. It employs a mechanism to build a model of a container's expected behavior, and then detects and blocks anomalous activities when some variance is found during the run time. It monitors container processes, network activities and file systems for patterns and changes that indicate an attack might be underway and blocks according to the configured rules. The models that learn what constitutes “normal” behaviors are built from both the static analysis of docker images and dynamic behavioral analysis for a preconfigured period. Our teams have found the results from our usage promising.</p>\""
  },
  {
    "name": "Terratest",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p><strong><a href=\"\"https://github.com/gruntwork-io/terratest\"\" target=\"\"_blank\"\" aria-label=\"\"Terratest. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Terratest<span class=\"\"pop-out-icon\"\"></span></a></strong> continues to be an interesting option for infrastructure testing. It is a Golang library that makes it easier to write automated tests. Using infrastructure-as-code tools such as <a href=\"\"https://www.thoughtworks.com/radar/tools/terraform\"\">Terraform</a>, you can create real infrastructure components (such as servers, firewalls or load balancers) to deploy applications on them and then validate the expected behavior using Terratest. At the end of the test, Terratest can undeploy the apps and clean up resources. Our teams report that this approach of testing deployed infrastructure components fosters confidence in the infrastructure as code. We see our teams writing a variety of infra security tests for application components and their integrations. These include detecting misconfigurations, verifying access control (e.g., to check whether certain IAM roles or permissions are correctly configured or to ensure only authorized users have access to specific resources) and network security tests to verify prevention of unauthorized traffic to sensitive resources to name a few. This allows security testing to be shifted left and provides feedback during development itself.</p>\""
  },
  {
    "name": "Thanos",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>Although <a href=\"\"https://www.thoughtworks.com/radar/tools/prometheus\"\">Prometheus</a> continues to be a solid option for a self-managed observability stack, many teams managing modern cloud-native distributed systems bump into its single-node limitations as their metrics grow in cardinality and sheer volume, and when they start needing high-availability setup. <strong><a href=\"\"https://thanos.io/\"\" target=\"\"_blank\"\" aria-label=\"\"Thanos. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Thanos<span class=\"\"pop-out-icon\"\"></span></a></strong> extends Prometheus by adding features that make it suitable for large-scale, long-term and highly available monitoring. It does this, for example, by introducing components that will read data from Prometheus instances and store it in object stores, manage retention and compaction in the object stores and federate querying across multiple Prometheus instances. Our teams have found the migration from Prometheus seamless, as Thanos maintains compatibility with the Prometheus query API. This means they can continue to use their existing dashboards, alerting tools and other tools that integrate with the Prometheus API. Although our teams have been successful with Thanos, we also recommend keeping an eye on <a href=\"\"https://cortexmetrics.io/\"\" target=\"\"_blank\"\" aria-label=\"\"Cortex. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Cortex<span class=\"\"pop-out-icon\"\"></span></a>, as another way to extend Prometheus.</p>\""
  },
  {
    "name": "Wiz",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><a href=\"\"https://www.wiz.io/\"\" target=\"\"_blank\"\" aria-label=\"\"Wiz. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\"><strong>Wiz</strong><span class=\"\"pop-out-icon\"\"></span></a> is another contender in the maturing cloud security platform landscape that allows its users to prevent, detect and respond to security risks and threats in one platform. Wiz can detect and alert on misconfigurations, vulnerabilities and leaked secrets both in artifacts that have yet to be deployed to live environments (container images, infrastructure code) as well as live workloads (containers, VMs and cloud services). It also contextualizes findings to the customer's specific cloud landscape to enable response teams to better understand the issue and prioritize mitigations. Our teams have had good experience with Wiz. They find that Wiz is rapidly evolving and adding new features, and they appreciate that it enables them to detect risks and threats sooner than some other similar tools as it continuously scans for changes.</p>\""
  },
  {
    "name": "Yalc",
    "ring": "trial",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://github.com/wclr/yalc\"\" target=\"\"_blank\"\" aria-label=\"\"Yalc. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Yalc<span class=\"\"pop-out-icon\"\"></span></a></strong> is a simple local JavaScript package repository and a tool for publishing and using packages across a local development environment. It's a more reliable alternative to the <a href=\"\"https://docs.npmjs.com/cli/link\"\" target=\"\"_blank\"\" aria-label=\"\"npm link. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">npm link<span class=\"\"pop-out-icon\"\"></span></a> command, which has some constraints. Yalc is useful when working with multiple packages, especially when some use yarn and some use npm. It's also helpful for testing the packages locally before publishing them to a remote registry. In our experience, Yalc is valuable in a multi-package setup and speeds up front-end and other JavaScript app development workflows.</p>\""
  },
  {
    "name": "ChatGPT",
    "ring": "assess",
    "quadrant": "tools",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p><strong><a href=\"\"https://openai.com/blog/chatgpt\"\" target=\"\"_blank\"\" aria-label=\"\"ChatGPT. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">ChatGPT<span class=\"\"pop-out-icon\"\"></span></a></strong> continues to attract attention. Imaginative use cases and innovative approaches to prompting mean it's gaining expanding utility over time. GPT4, the large language model (LLM) that powers ChatGPT, now also has the ability to integrate with external tools such as a knowledge management repository, sandboxed coding environment or web search. The recent introduction of <a href=\"\"https://openai.com/blog/introducing-chatgpt-enterprise\"\" target=\"\"_blank\"\" aria-label=\"\"ChatGPT Enterprise. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">ChatGPT Enterprise<span class=\"\"pop-out-icon\"\"></span></a> may help ease intellectual property concerns, while providing \"\"enterprise\"\" features such as usage tracking and better user management through SSO.</p><br><br><p>Although ChatGPT's ability to \"\"write\"\" code has been much vaunted, we think organizations should be looking at using it across the full software lifecycle to improve efficiency and reduce errors. For example, ChatGPT can provide additional perspectives or suggestions for tasks as diverse as requirements analysis, architectural design or the reverse engineering of legacy systems. We still think ChatGPT is best used as an input to a process — such as helping with a first draft of a story or the boilerplate for a coding task — rather than a tool that produces \"\"fully baked\"\" results. That said, its capabilities are improving each week, and some programming tasks may now be fully possible by careful prompting, which is an <a href=\"\"https://www.thoughtworks.com/radar/techniques/prompt-engineering\"\">art in itself</a>.</p>\""
  },
  {
    "name": "Codeium",
    "ring": "assess",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>In the AI-powered coding assistants space, <strong><a href=\"\"https://codeium.com/\"\" target=\"\"_blank\"\" aria-label=\"\"Codeium. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Codeium<span class=\"\"pop-out-icon\"\"></span></a></strong> is one of the more promising products. Similar to <a href=\"\"https://www.thoughtworks.com/radar/tools/tabnine\"\">Tabnine</a>, Codeium tries to address some of the biggest concerns companies have about coding assistants: They reduce at least some of the open-source licensing concerns, because they do not train their models with code from repositories with nonpermissive licenses. They also offer self-hosting for the tool so you don't have to send your code snippets to a third-party service. Codeium stands out for its broad support of IDEs and notebook services, and although it hasn't been around for as long as <a href=\"\"https://www.thoughtworks.com/radar/tools/github-copilot\"\">GitHub Copilot</a> or Tabnine, our first impressions of the product have been positive.</p>\""
  },
  {
    "name": "GitHub merge queue",
    "ring": "assess",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>We've long been advocates of short-lived developer branches that are merged frequently into the main code branch, which is kept ready for deployment. This practice of trunk-based development goes hand-in-hand with continuous integration and, when conditions permit, results in the fastest feedback cycles and most efficient developer flow. However, not everyone favors this approach, and we frequently adapt our style to accommodate our clients’ practices. Sometimes this includes long-lived feature branches followed by pull requests that must be manually reviewed and approved before they're merged into the main branch. In these situations, we use the new <strong><a href=\"\"https://github.blog/2023-07-12-github-merge-queue-is-generally-available/\"\" target=\"\"_blank\"\" aria-label=\"\"GitHub merge queue. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">GitHub merge queue<span class=\"\"pop-out-icon\"\"></span></a></strong> feature. It allows us to automatically queue up incoming pull requests and merge them into a special branch in the order they were received. We then have the option of automating our own \"\"merge checks\"\" to prevent incompatible commits. This essentially simulates trunk-based development (even though PRs have not been merged into the main code branch yet) and allows developers to test their features in context without having to wait for the pull request to be approved. With GitHub merge queue,  you get the benefits of trunk-based development even when you're not able to fully commit to it.</p>\""
  },
  {
    "name": "Google Bard",
    "ring": "assess",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://bard.google.com/\"\" target=\"\"_blank\"\" aria-label=\"\"Google Bard. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Google Bard<span class=\"\"pop-out-icon\"\"></span></a></strong> is a generative AI chatbot developed by Google AI. Much like <a href=\"\"https://www.thoughtworks.com/radar/tools/chatgpt\"\">ChatGPT</a>, it’s conversational and able to communicate and generate human-like text in response to a wide range of prompts and questions. Bard is powered by Google's <a href=\"\"https://ai.google/discover/palm2/\"\" target=\"\"_blank\"\" aria-label=\"\"Pathways Language Model (PaLM 2). This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Pathways Language Model (PaLM 2)<span class=\"\"pop-out-icon\"\"></span></a>, which is a large language model (LLM) that’s trained on a massive data set of text and code. Bard is able to generate text, translate languages, write different kinds of creative content and answer your questions in an informative way.</p><br><br><p>Bard can also be used as a guidance tool for software development. Sometimes, our developers have found it useful to get some coding suggestions or best practices and infrastructure configurations for different scenarios. We also experimented with Bard for the Radar's language translations and got decent results to create the first draft of the text. Although the tool is still in development, which is why it can be a bit slower when compared to ChatGPT, we encourage developers to explore the tool and assess its potential benefits.</p>\""
  },
  {
    "name": "Google Cloud Workstations",
    "ring": "assess",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://cloud.google.com/workstations\"\" target=\"\"_blank\"\" aria-label=\"\"Google Cloud Workstations. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Google Cloud Workstations<span class=\"\"pop-out-icon\"\"></span></a></strong> is GCP's Cloud Development Environment (CDE) offering. It offers fully managed containerized development environments that are accessible through SSH, HTTPS, VSCode and Jetbrains IDEs among others, giving developers the illusion of connecting to a local environment. Google Cloud Workstations allows administrators to make the containerized development environments part of a private network and to be either publicly or privately accessible. This ability to tweak networking configurations, along with support to create the environments with either custom or predefined images, makes Google Cloud Workstations, in our view, worth assessing for organizations looking for a secure CDE solution within their own GCP perimeter. If you're considering Google Cloud Workstations, we recommend that you test your networking configuration before rolling it out widely, as high latency can become a real friction to the developer experience of these containers.</p>\""
  },
  {
    "name": "Gradio",
    "ring": "assess",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://github.com/gradio-app/gradio\"\" target=\"\"_blank\"\" aria-label=\"\"Gradio. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Gradio<span class=\"\"pop-out-icon\"\"></span></a></strong> is an open-source Python library that allows for the quick-and-easy creation of interactive web-based interfaces for ML models. A graphical user interface on top of ML models enables a better understanding of the inputs, constraints and outputs by nontechnical audiences. Gradio supports many input and output types — from text and images to voice — and has emerged as a go-to tool for rapid prototyping and model evaluation. Gradio lets you easily host your demos on <a href=\"\"https://huggingface.co/\"\" target=\"\"_blank\"\" aria-label=\"\"Hugging Face. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Hugging Face<span class=\"\"pop-out-icon\"\"></span></a> or run them locally and enable others to access your <a href=\"\"https://www.gradio.app/guides/sharing-your-app\"\" target=\"\"_blank\"\" aria-label=\"\"demo remotely. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">demo remotely<span class=\"\"pop-out-icon\"\"></span></a> with a \"\"XXXXX.gradio.app\"\" url. For example, the famous DALL-E mini experiment leverages Gradio and is hosted on <a href=\"\"https://huggingface.co/spaces/dalle-mini/dalle-mini\"\" target=\"\"_blank\"\" aria-label=\"\"Hugging Face Spaces. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Hugging Face Spaces<span class=\"\"pop-out-icon\"\"></span></a>. Our teams have been happy using this library for experimentation and prototyping, which is why we put it in Assess.</p>\""
  },
  {
    "name": "KWOK",
    "ring": "assess",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://github.com/kubernetes-sigs/kwok\"\" target=\"\"_blank\"\" aria-label=\"\"KWOK. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">KWOK<span class=\"\"pop-out-icon\"\"></span></a></strong> (Kubernetes WithOut Kubelet) is a tool for simulating the lifecycle of fake nodes and pods in order to test the control plane of a <a href=\"\"https://www.thoughtworks.com/radar/platforms/kubernetes\"\">Kubernetes</a> cluster. It is difficult to stress test custom Kubernetes controllers and operators without a significantly large cluster. However, with KWOK you can easily set up a cluster with thousands of nodes on your laptop without it consuming a significant amount of CPU or memory. This simulation enables different configurations of node types and pods to test various scenarios and edge cases. If you need a real cluster to test your operators and custom resource definitions (CRDs), we recommend <a href=\"\"https://www.thoughtworks.com/radar/tools/kind\"\">kind</a> or <a href=\"\"https://www.thoughtworks.com/radar/platforms/k3s\"\">k3s</a>; but if you only need to simulate a large number of fake nodes, then we encourage you to assess KWOK.</p>\""
  },
  {
    "name": "Llama 2",
    "ring": "assess",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://ai.meta.com/llama/\"\" target=\"\"_blank\"\" aria-label=\"\"Llama 2. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Llama 2<span class=\"\"pop-out-icon\"\"></span></a></strong>, from Meta, is a powerful language model that is free for both research and commercial use.  It's available both as a raw pretrained model and, fine-tuned, as Llama-2-chat for conversation and <a href=\"\"https://ai.meta.com/blog/code-llama-large-language-model-coding/\"\" target=\"\"_blank\"\" aria-label=\"\"Code Llama. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Code Llama<span class=\"\"pop-out-icon\"\"></span></a> for code completion. Since it's available in a variety of sizes — 7B, 13B, and 70B — Llama 2 is a good option for a <a href=\"\"https://www.thoughtworks.com/radar/techniques/self-hosted-llms\"\">self-hosted LLM</a>, if you want to control your data.</p><br><br><p>Meta describes Llama 2 as \"\"open source,\"\" a claim that <a href=\"\"https://blog.opensource.org/metas-llama-2-license-is-not-open-source/\"\" target=\"\"_blank\"\" aria-label=\"\"has attracted some criticism. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">has attracted some criticism<span class=\"\"pop-out-icon\"\"></span></a>. Meta's license and acceptable use policy put restrictions on commercial use for some users and also restricts the use of the model and software for certain purposes. The Llama 2 training data is not open, which can hamper the ability to understand and change the model. That said, the availability of a powerful, capable model in at least a \"\"semi-open\"\" form is welcome.</p>\""
  },
  {
    "name": "Maestro",
    "ring": "assess",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://maestro.mobile.dev/\"\" target=\"\"_blank\"\" aria-label=\"\"Maestro. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Maestro<span class=\"\"pop-out-icon\"\"></span></a></strong> is a new cross-platform mobile UI test automation tool with built-in tolerance for flakiness and variance in application load times because of network or external factors. With a declarative YAML syntax, it makes it easy to write and maintain automated tests for mobile apps. It supports iOS and Android native apps, <a href=\"\"https://www.thoughtworks.com/radar/languages-and-frameworks/react-native\"\">React Native</a> and <a href=\"\"https://www.thoughtworks.com/radar/languages-and-frameworks/flutter\"\">Flutter</a> apps, as well as a variety of features for automating complex mobile UI interactions, such as tapping, scrolling and swiping. Maestro is distributed as a single binary for ease of use, runs in interpreted mode and makes it easy to author new tests thanks to features like continuous mode. Maestro still lacks specific features like support for iOS devices, but the tool is rapidly evolving.</p>\""
  },
  {
    "name": "Open-source LLMs for coding",
    "ring": "assess",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><a href=\"\"https://www.thoughtworks.com/radar/tools/github-copilot\"\">GitHub Copilot</a> is a valuable tool for coding assistance while developing software. Under the hood, <a href=\"\"https://github.blog/2023-05-17-inside-github-working-with-the-llms-behind-github-copilot/\"\" target=\"\"_blank\"\" aria-label=\"\"LLMs. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">LLMs<span class=\"\"pop-out-icon\"\"></span></a> can power seamless developer experiences through inline code assistance, code fine-tuning, conversational support in the IDE and much more. Most of these models are proprietary and can only be used via subscription services. The good news is you can use several <strong>open-source LLMs for coding</strong>. If you’re in a space where you need to build your own coding assistance service (such as a highly regulated industry), look at models like <a href=\"\"https://github.com/bigcode-project/starcoder\"\" target=\"\"_blank\"\" aria-label=\"\"StarCoder. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">StarCoder<span class=\"\"pop-out-icon\"\"></span></a> and <a href=\"\"https://github.com/nlpxucan/WizardLM/blob/main/WizardCoder/README.md\"\" target=\"\"_blank\"\" aria-label=\"\"WizardCoder. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">WizardCoder<span class=\"\"pop-out-icon\"\"></span></a>. StarCoder is trained with a large <a href=\"\"https://huggingface.co/datasets/bigcode/starcoderdata\"\" target=\"\"_blank\"\" aria-label=\"\"data set. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">data set<span class=\"\"pop-out-icon\"\"></span></a> maintained by <a href=\"\"https://www.bigcode-project.org/\"\" target=\"\"_blank\"\" aria-label=\"\"BigCode. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">BigCode<span class=\"\"pop-out-icon\"\"></span></a>, and Wizardcoder is an <a href=\"\"https://github.com/nlpxucan/evol-instruct\"\" target=\"\"_blank\"\" aria-label=\"\"Evol-Instruct. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Evol-Instruct<span class=\"\"pop-out-icon\"\"></span></a> tuned StarCoder model.</p><br><br><p>We've used StarCoder in our experiments and found it to be useful for generating structured software engineering elements such as code, YAML, SQL and JSON. Based on our experiments, we found both the models to be receptive to <a href=\"\"https://thegradient.pub/in-context-learning-in-context/\"\" target=\"\"_blank\"\" aria-label=\"\"in-context learning. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">in-context learning<span class=\"\"pop-out-icon\"\"></span></a> using <a href=\"\"https://www.promptingguide.ai/techniques/fewshot\"\" target=\"\"_blank\"\" aria-label=\"\"few-shot. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">few-shot<span class=\"\"pop-out-icon\"\"></span></a> examples in the prompt. Nonetheless, for specific downstream tasks (such as SQL generation for a specific database like Postgres) the models needed <a href=\"\"https://huggingface.co/docs/trl/main/en/sft_trainer\"\" target=\"\"_blank\"\" aria-label=\"\"fine-tuning. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">fine-tuning<span class=\"\"pop-out-icon\"\"></span></a>. Recently, Meta unveiled its Code Llama, a code-specialized version of <a href=\"\"https://www.thoughtworks.com/radar/tools/llama-2\"\">Llama 2</a>. Be sure to proceed with caution when using these open-source models. Consider their <a href=\"\"https://www.licenses.ai/blog/2022/8/26/bigscience-open-rail-m-license\"\" target=\"\"_blank\"\" aria-label=\"\"license. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">license<span class=\"\"pop-out-icon\"\"></span></a>, the license of the code and of the data set used to train the model. Carefully assess these aspects before you choose any of these coding LLMs for your organization.</p>\""
  },
  {
    "name": "OpenCost",
    "ring": "assess",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://www.opencost.io/\"\" target=\"\"_blank\"\" aria-label=\"\"OpenCost. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">OpenCost<span class=\"\"pop-out-icon\"\"></span></a></strong> is an open-source project for monitoring infrastructure cost that surfaces cost at the granularity of <a href=\"\"https://www.thoughtworks.com/radar/platforms/kubernetes\"\">Kubernetes</a> objects (pods, containers, clusters, etc.), covering various in-cluster resources (CPU, GPU, RAM, storage, network). It has integrations with multiple cloud provider APIs to obtain billing data and can be configured with pricing for on-premise Kubernetes clusters. OpenCost is the cost allocation engine originally built and still used by <a href=\"\"https://www.kubecost.com/\"\" target=\"\"_blank\"\" aria-label=\"\"Kubecost. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Kubecost<span class=\"\"pop-out-icon\"\"></span></a>, but it can also be used on its own. Cost allocation data from OpenCost can be exported into CSV files or to <a href=\"\"https://www.opencost.io/docs/integrations/opencost-exporter\"\" target=\"\"_blank\"\" aria-label=\"\"Prometheus. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Prometheus<span class=\"\"pop-out-icon\"\"></span></a> for further analysis and visualization. Our teams are keenly watching the developments of tools like OpenCost and Kubecost that enable cost visibility for product and platform teams in organizations that have adopted Kubernetes. In these early stages, they find that OpenCost doesn't work well yet with certain workloads such as short-lived spot instances often used in data pipelines.</p>\""
  },
  {
    "name": "OpenRewrite",
    "ring": "assess",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>We've seen several use cases for code intelligence tools: moving to a new API version of a widely used library, understanding the impact of a just discovered vulnerability in such a library across an enterprise or applying updates to many services that were created from the same template. <a href=\"\"https://www.thoughtworks.com/radar/tools/sourcegraph\"\">Sourcegraph</a> is still a popular tool in this space, and <strong><a href=\"\"https://github.com/openrewrite/rewrite\"\" target=\"\"_blank\"\" aria-label=\"\"OpenRewrite. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">OpenRewrite<span class=\"\"pop-out-icon\"\"></span></a></strong> is another tool we want to highlight. While our teams have mostly used it in Java for narrow problems, like updating services created through a starter kit, it continues to broaden its coverage of languages and use cases. We like that it comes bundled with a catalog of recipes, which describe the changes to be made, for example for migrating commonly used frameworks across versions. The refactoring engine, bundled recipes and build tool plugins are open-source software, which makes it easier for teams to reach for OpenRewrite just when they need it. It remains to be seen how the maturing space of code intelligence tools, which are all based on parsing the source code into an abstract syntax tree (AST), will be impacted by the rapid developments in the space of LLMs.</p>\""
  },
  {
    "name": "OrbStack",
    "ring": "assess",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://orbstack.dev/\"\" target=\"\"_blank\"\" aria-label=\"\"OrbStack. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">OrbStack<span class=\"\"pop-out-icon\"\"></span></a></strong> is a way to run Docker containers on macOS; our developers have found it to be more lightweight, faster and simpler to set up and use than <a href=\"\"https://www.docker.com/products/docker-desktop/\"\" target=\"\"_blank\"\" aria-label=\"\"Docker Desktop. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Docker Desktop<span class=\"\"pop-out-icon\"\"></span></a> and <a href=\"\"https://www.thoughtworks.com/radar/platforms/colima\"\">Colima</a>. The tool is still under development and therefore has fewer features, but it's already showing some great potential with its simplicity and speed. You can also use OrbStack to create and manage Linux VMs on macOS.</p>\""
  },
  {
    "name": "pgvector",
    "ring": "assess",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>With the rise of Generative AI-powered applications, we see a pattern of storing and efficiently searching <a href=\"\"https://www.featureform.com/post/the-definitive-guide-to-embeddings\"\" target=\"\"_blank\"\" aria-label=\"\"embeddings. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">embeddings<span class=\"\"pop-out-icon\"\"></span></a> vectors for similarities. <strong><a href=\"\"https://github.com/pgvector/pgvector\"\" target=\"\"_blank\"\" aria-label=\"\"pgvector. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">pgvector<span class=\"\"pop-out-icon\"\"></span></a></strong> is an open-source vector similarity search extension for PostgreSQL. We quite like it because it enables us to search the embeddings in PostgreSQL without moving the data to another store just for similarity search. Although there are several specialized <a href=\"\"https://github.com/currentslab/awesome-vector-search\"\" target=\"\"_blank\"\" aria-label=\"\"vector search engines. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">vector search engines<span class=\"\"pop-out-icon\"\"></span></a>, we want you to assess pgvector.</p>\""
  },
  {
    "name": "Pixie",
    "ring": "assess",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://github.com/pixie-io/pixie\"\" target=\"\"_blank\"\" aria-label=\"\"Pixie. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Pixie<span class=\"\"pop-out-icon\"\"></span></a></strong> is an observability tool for <a href=\"\"https://www.thoughtworks.com/radar/platforms/kubernetes\"\">Kubernetes</a> native applications. It takes an interesting approach toward observability by leveraging <a href=\"\"https://www.thoughtworks.com/radar/platforms/ebpf\"\">eBPF</a> to automatically collect telemetry data from multiple <a href=\"\"https://docs.px.dev/about-pixie/data-sources/\"\" target=\"\"_blank\"\" aria-label=\"\"data sources. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">data sources<span class=\"\"pop-out-icon\"\"></span></a>. Collected telemetry data is stored locally in each node and processed centrally via its control plane API. Overall, we find Pixie worthwhile to assess for observability in the Kubernetes ecosystem.</p>\""
  },
  {
    "name": "Tabnine",
    "ring": "assess",
    "quadrant": "tools",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://www.tabnine.com/\"\" target=\"\"_blank\"\" aria-label=\"\"Tabnine. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Tabnine<span class=\"\"pop-out-icon\"\"></span></a></strong> is a contender in the currently busy space of coding assistants. It provides in-line code completion suggestions and a chat directly in the IDE. Similar to <a href=\"\"https://www.thoughtworks.com/radar/tools/github-copilot\"\">GitHub Copilot</a>, Tabnine has been around since before the current hype cycle and is therefore one of the more mature products in the space. Unlike Copilot, it uses a model that is only trained on permissively licensed code and offers a version to self-host for organizations that worry about sending their code snippets to a third-party service. Tabnine is available as a limited free version as well as a paid version, which has more comprehensive suggestions and also offers a mode with a local (albeit less powerful) model that you can use without internet connection.</p>\""
  },
  {
    "name": "dbt",
    "ring": "adopt",
    "quadrant": "languages-and-frameworks",
    "isNew": "FALSE",
    "status": "moved in",
    "description": "\"<p><a href=\"\"https://www.getdbt.com/\"\" target=\"\"_blank\"\" aria-label=\"\"dbt. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\"><strong>dbt</strong><span class=\"\"pop-out-icon\"\"></span></a> continues to be our tool of choice for data transformations in the ELT workflow. We like that it lends itself to engineering rigor and enables practices like modularity, testability and reusability of SQL-based transformations. dbt is available both as an open-source and commercial SaaS product and has a healthy ecosystem, including a community hub with packages for unit testing, data quality and data observability, to name a few. Packages worth highlighting include <a href=\"\"https://www.thoughtworks.com/radar/languages-and-frameworks/dbt-expectations\"\">dbt-expectations</a> and <a href=\"\"https://www.thoughtworks.com/radar/languages-and-frameworks/dbt-unit-testing\"\">dbt-unit-testing</a> which facilitate data quality checks and unit testing of the transformations, respectively. dbt <a href=\"\"https://docs.getdbt.com/docs/supported-data-platforms\"\" target=\"\"_blank\"\" aria-label=\"\"integrates. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">integrates<span class=\"\"pop-out-icon\"\"></span></a> well with a variety of cloud data warehouses, lakehouses and databases, including <a href=\"\"https://www.thoughtworks.com/radar/platforms/snowflake\"\">Snowflake</a>, <a href=\"\"https://www.thoughtworks.com/radar/platforms/bigquery\"\">BigQuery</a>, Redshift, Databricks and Postgres. When working with structured data where one can set up transformations as SQL, our teams prefer dbt — which is why we're moving it to Adopt.</p>\""
  },
  {
    "name": "Playwright",
    "ring": "adopt",
    "quadrant": "languages-and-frameworks",
    "isNew": "FALSE",
    "status": "moved in",
    "description": "\"<p>With <strong><a href=\"\"https://playwright.dev/\"\" target=\"\"_blank\"\" aria-label=\"\"Playwright. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Playwright<span class=\"\"pop-out-icon\"\"></span></a></strong> you can write end-to-end tests that run in Chrome, Firefox and WebKit. By using the Chrome DevTools Protocol (CDP) Playwright can offer new features and eliminate many of the issues seen with WebDriver. Chromium-based browsers implement CDP directly. To support Firefox and Webkit, though, the Playwright team has to submit patches to these browsers, which may sometimes limit the framework.</p><br><br><p>Playwright’s many features include: Built-in auto-waits, which result in tests that are more reliable and easier to understand; browser contexts, which let you test that persisting sessions across tabs work properly; and the ability to simulate notifications, geolocation and dark mode settings. Our teams are impressed with the stability Playwright brings to the test suite and like that they get feedback more quickly by running tests in parallel. Other features that set Playwright apart include better support for lazy loading and tracing. Although Playwright has some limitations — component support is currently experimental, for example — our teams consider it the go-to test framework and in some cases are migrating away from <a href=\"\"https://www.thoughtworks.com/radar/tools/cypress\"\">Cypress</a> and <a href=\"\"https://www.thoughtworks.com/radar/languages-and-frameworks/puppeteer\"\">Puppeteer</a>.</p>\""
  },
  {
    "name": ".NET Minimal API",
    "ring": "trial",
    "quadrant": "languages-and-frameworks",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>ASP.NET core MVC has proven to be a powerful and flexible approach for building web applications that host APIs. However, its flexibility brings a certain amount of complexity with it, including boilerplate and conventions that aren't always obvious. The routing provided by ASP.NET allows multiple services to be hosted in a single application, but in today's world of serverless functions and independently deployable microservices, that flexibility might be overkill. <strong><a href=\"\"https://learn.microsoft.com/en-us/aspnet/core/fundamentals/minimal-apis?view=aspnetcore-7.0\"\" target=\"\"_blank\"\" aria-label=\"\".NET Minimal APIs. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">.NET Minimal APIs<span class=\"\"pop-out-icon\"\"></span></a></strong> provide a simple approach to implementing a single-API web application in the .NET ecosystem. The Minimal API framework can implement an API endpoint with just a few lines of code. Minimal API joins the new generation of API frameworks — including <a href=\"\"https://www.thoughtworks.com/radar/languages-and-frameworks/micronaut\"\">Micronaut</a>, <a href=\"\"https://www.thoughtworks.com/radar/languages-and-frameworks/quarkus\"\">Quarkus</a> and <a href=\"\"https://helidon.io/\"\" target=\"\"_blank\"\" aria-label=\"\"Helidon. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Helidon<span class=\"\"pop-out-icon\"\"></span></a> — which are optimized for lightweight deployments and fast startup times. We're interested in the combination of Minimal APIs and <a href=\"\"https://www.thoughtworks.com/radar/languages-and-frameworks/net-7-native-aot\"\">.NET 7 Native AOT</a> for implementing simple, lightweight microservices in serverless functions.</p>\""
  },
  {
    "name": "Ajv",
    "ring": "trial",
    "quadrant": "languages-and-frameworks",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://ajv.js.org/\"\" target=\"\"_blank\"\" aria-label=\"\"Ajv. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Ajv<span class=\"\"pop-out-icon\"\"></span></a></strong> is a popular JavaScript library used to validate a data object against a structure defined using a JSON Schema. Ajv is fast and flexible for validating complex data types. It supports a wide range of schema features, including custom keywords and formats. It's used by many open-source JavaScript applications and libraries. Our teams have used Ajv for implementing <a href=\"\"https://www.thoughtworks.com/radar/techniques/consumer-driven-contract-testing\"\">consumer-driven contract testing</a> in CI workflows, and, along with other tools for generating mock data with the JSON Schema, it's very powerful. In the TypeScript world, <a href=\"\"https://github.com/colinhacks/zod\"\" target=\"\"_blank\"\" aria-label=\"\"Zod. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Zod<span class=\"\"pop-out-icon\"\"></span></a> is a popular alternative that has a declarative API for defining the schema and validating the data.</p>\""
  },
  {
    "name": "Armeria",
    "ring": "trial",
    "quadrant": "languages-and-frameworks",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://armeria.dev/\"\" target=\"\"_blank\"\" aria-label=\"\"Armeria. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Armeria<span class=\"\"pop-out-icon\"\"></span></a></strong> is an open-source framework for building microservices. Our teams have used it to build asynchronous APIs, and we quite like the approach to address cross-cutting concerns, like distributed tracing or circuit breakers, via <a href=\"\"https://armeria.dev/docs/server-decorator\"\" target=\"\"_blank\"\" aria-label=\"\"service decorators. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">service decorators<span class=\"\"pop-out-icon\"\"></span></a>. The framework includes port reuse for both gRPC and REST traffic among other clever design choices. With Armeria, we can incrementally add new features in gRPC on top of an existing codebase in REST or vice versa. Overall, we find Armeria to be a flexible microservices framework with several out-of-the-box <a href=\"\"https://github.com/line/armeria-examples\"\" target=\"\"_blank\"\" aria-label=\"\"integrations. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">integrations<span class=\"\"pop-out-icon\"\"></span></a>.</p>\""
  },
  {
    "name": "AWS SAM",
    "ring": "trial",
    "quadrant": "languages-and-frameworks",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>The <strong><a href=\"\"https://aws.amazon.com/serverless/sam/\"\" target=\"\"_blank\"\" aria-label=\"\"AWS Serverless Application Model (SAM). This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">AWS Serverless Application Model (SAM)<span class=\"\"pop-out-icon\"\"></span></a></strong> is an open-source framework for building serverless applications on the AWS Cloud infrastructure. Previously we blipped <a href=\"\"https://www.thoughtworks.com/radar/tools/serverless-framework\"\">Serverless Framework</a> as a popular framework for deploying serverless services on various cloud providers, primarily <a href=\"\"https://www.thoughtworks.com/radar/platforms/aws-lambda\"\">AWS Lambda</a>-based services. AWS SAM has gained popularity in recent times as the framework has come a long way from its early days. Our teams have found it very easy to set up, and they also use it for testing and debugging AWS Lambda-based services, including local executions of Lambdas for development.</p>\""
  },
  {
    "name": "Bloc",
    "ring": "trial",
    "quadrant": "languages-and-frameworks",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://bloclibrary.dev\"\" target=\"\"_blank\"\" aria-label=\"\"Bloc. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Bloc<span class=\"\"pop-out-icon\"\"></span></a></strong> is a reactive state management library for <a href=\"\"https://www.thoughtworks.com/radar/languages-and-frameworks/flutter\"\">Flutter</a>. Among the available <a href=\"\"https://flutter.dev/docs/development/data-and-backend/state-mgmt/options\"\" target=\"\"_blank\"\" aria-label=\"\"state management. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">state management<span class=\"\"pop-out-icon\"\"></span></a> options for Flutter, we want to highlight Bloc because our teams have had good experience with the library when building complex mobile applications. Structurally organizing code around the <a href=\"\"https://www.flutteris.com/blog/en/reactive-programming-streams-bloc\"\" target=\"\"_blank\"\" aria-label=\"\"BLoC pattern. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">BLoC pattern<span class=\"\"pop-out-icon\"\"></span></a> resulted in clean separation of business logic from the presentation layer as the UI Widgets communicate via streams and event sinks with business logic. Bloc also has good plugin support in both <a href=\"\"https://plugins.jetbrains.com/plugin/12129-bloc\"\" target=\"\"_blank\"\" aria-label=\"\"IntelliJ. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">IntelliJ<span class=\"\"pop-out-icon\"\"></span></a> and <a href=\"\"https://marketplace.visualstudio.com/items?itemName=FelixAngelov.bloc\"\" target=\"\"_blank\"\" aria-label=\"\"VSCode. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">VSCode<span class=\"\"pop-out-icon\"\"></span></a> IDEs.</p>\""
  },
  {
    "name": "Dart",
    "ring": "trial",
    "quadrant": "languages-and-frameworks",
    "isNew": "FALSE",
    "status": "moved in",
    "description": "\"<p><strong><a href=\"\"https://dart.dev/\"\" target=\"\"_blank\"\" aria-label=\"\"Dart. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Dart<span class=\"\"pop-out-icon\"\"></span></a></strong> is a programming language developed by Google that supports building apps targeting multiple platforms, including web browsers, <a href=\"\"https://www.thoughtworks.com/radar/languages-and-frameworks/webassembly\"\">WebAssembly</a>, desktop and mobile apps. Its adoption has been driven by the dominance of <a href=\"\"https://www.thoughtworks.com/radar/languages-and-frameworks/flutter\"\">Flutter</a> — a popular, multi-platform UI toolkit powered by Dart — in the cross-platform native mobile app framework space. In response to community feedback, Dart has evolved since its initial versions and has added built-in <a href=\"\"https://dart.dev/null-safety\"\" target=\"\"_blank\"\" aria-label=\"\"sound null safety. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">sound null safety<span class=\"\"pop-out-icon\"\"></span></a> in version three, in addition to a robust type system. Furthermore, Dart's ecosystem is growing rapidly, with a vibrant community and a wide range of available libraries and tools, making it attractive for developers.</p>\""
  },
  {
    "name": "fast-check",
    "ring": "trial",
    "quadrant": "languages-and-frameworks",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://github.com/dubzzz/fast-check\"\" target=\"\"_blank\"\" aria-label=\"\"fast-check. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">fast-check<span class=\"\"pop-out-icon\"\"></span></a></strong> is a property-based testing tool for JavaScript and TypeScript, capable of automatically generating test data so a wide range of inputs can be explored without creating separate tests. This makes it easier to uncover edge scenarios. Our teams are reporting good results using fast-check in back-end testing  due to its good documentation, ease of use and seamless integration with existing testing frameworks, which enhances unit testing efficiency.</p>\""
  },
  {
    "name": "Kotlin with Spring",
    "ring": "trial",
    "quadrant": "languages-and-frameworks",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>Five years ago we moved <a href=\"\"https://www.thoughtworks.com/radar/languages-and-frameworks/kotlin\"\">Kotlin</a> into the Adopt ring, and today many of our teams report that Kotlin is not only their default choice on the JVM but that it has displaced Java almost completely in the software they write. At the same time, <a href=\"\"https://www.thoughtworks.com/radar/techniques/microservice-envy\"\">microservice envy</a> appears to be fading — we’ve noticed people starting to explore architectures with larger deployable units, using frameworks like <a href=\"\"https://www.thoughtworks.com/radar/languages-and-frameworks/spring-modulith\"\">Spring Modulith</a> among others. We're aware of many good Kotlin-native frameworks and have mentioned some of them previously; however, in some cases, the maturity and feature-richness of the Spring framework is a real asset, and we've been using <strong>Kotlin with Spring</strong> successfully, usually with no or only smaller issues.</p>\""
  },
  {
    "name": "Mockery",
    "ring": "trial",
    "quadrant": "languages-and-frameworks",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://github.com/vektra/mockery\"\" target=\"\"_blank\"\" aria-label=\"\"Mockery. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Mockery<span class=\"\"pop-out-icon\"\"></span></a></strong> is a mature <a href=\"\"https://www.thoughtworks.com/radar/languages-and-frameworks/go-language\"\">Golang</a> library that helps generate mock implementations of interfaces and simulates the behavior of external dependencies. With type-safe methods to generate call expectations and flexible ways to mock return values, it enables the tests to focus on the business logic rather than worrying about the correctness of external dependencies. Mockery uses Go generators and simplifies the generation and management of the mocks in the test suite.</p>\""
  },
  {
    "name": "Netflix DGS",
    "ring": "trial",
    "quadrant": "languages-and-frameworks",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>We mostly use <a href=\"\"https://www.thoughtworks.com/radar/techniques/graphql-for-server-side-resource-aggregation\"\">GraphQL for server-side resource aggregation</a> and have implemented the server side using a variety of technologies. For services written with <a href=\"\"https://www.thoughtworks.com/radar/languages-and-frameworks/spring-boot\"\">Spring Boot</a>, our teams have had good experiences with <strong><a href=\"\"https://netflix.github.io/dgs/\"\" target=\"\"_blank\"\" aria-label=\"\"Netflix DGS. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Netflix DGS<span class=\"\"pop-out-icon\"\"></span></a></strong>. It's built on top of graphql-java and provides features and abstractions in the Spring Boot programming model that make it easy to implement GraphQL endpoints and integrate with Spring features such as Spring Security. Although it's written in Kotlin, DGS works equally well with Java.</p>\""
  },
  {
    "name": "OpenTelemetry",
    "ring": "trial",
    "quadrant": "languages-and-frameworks",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p>We've been using <strong><a href=\"\"https://opentelemetry.io/\"\" target=\"\"_blank\"\" aria-label=\"\"OpenTelemetry. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">OpenTelemetry<span class=\"\"pop-out-icon\"\"></span></a></strong> as a solution for a while now and recommended trying it in previous editions. Its ability to seamlessly capture, instrument and manage telemetry data across various services and applications has improved our observability stack. OpenTelemetry's flexibility and compatibility with diverse environments have made it a valuable addition to our toolkit. We're now particularly curious about the recent release of the <a href=\"\"https://opentelemetry.io/docs/specs/otel/protocol/\"\" target=\"\"_blank\"\" aria-label=\"\"OpenTelemetry Protocol (OTLP). This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">OpenTelemetry Protocol (OTLP)<span class=\"\"pop-out-icon\"\"></span></a> specification, which includes both gRPC and HTTP. This protocol standardizes the format and transmission of telemetry data, promoting interoperability and simplifying integrations with other monitoring and analysis tools. As we continue to explore the integration potential of the protocol, we're evaluating its long-term impact on our monitoring and observability strategy and on the general monitoring landscape.</p>\""
  },
  {
    "name": "Polars",
    "ring": "trial",
    "quadrant": "languages-and-frameworks",
    "isNew": "FALSE",
    "status": "moved in",
    "description": "\"<p><strong><a href=\"\"https://github.com/pola-rs/polars\"\" target=\"\"_blank\"\" aria-label=\"\"Polars. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Polars<span class=\"\"pop-out-icon\"\"></span></a></strong> is an in-memory data frame library implemented in <a href=\"\"https://www.thoughtworks.com/radar/languages-and-frameworks/rust\"\">Rust</a>. Unlike other data frames (such as pandas), Polars is multithreaded, supports lazy execution and is safe for parallel operations. The in-memory data is organized in the <a href=\"\"https://arrow.apache.org/\"\" target=\"\"_blank\"\" aria-label=\"\"Apache Arrow. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Apache Arrow<span class=\"\"pop-out-icon\"\"></span></a> format for efficient analytic operations and to enable interoperability with other tools. If you're familiar with pandas, you can quickly get started with Polars' Python bindings. We believe Polars, with Rust implementation and Python bindings, is a performant in-memory data frame for your analytical needs. Our teams continue to have a good experience with Polars which is why we're moving it to Trial.</p>\""
  },
  {
    "name": "Pushpin",
    "ring": "trial",
    "quadrant": "languages-and-frameworks",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://pushpin.org\"\" target=\"\"_blank\"\" aria-label=\"\"Pushpin. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Pushpin<span class=\"\"pop-out-icon\"\"></span></a></strong> is a reverse proxy that acts as an intermediary between clients and back-end servers handling long-lived connections, such as WebSockets and Server-Sent Events. It provides a way to terminate long-lived connections from clients and means the rest of the system can be abstracted from this complexity. It effectively manages a large number of persistent connections and automatically distributes them across multiple back-end servers, optimizing performance and reliability. Our experience using this for real-time communication with mobile devices using WebSockets has been good, and we've been able to scale it horizontally for millions of devices.</p>\""
  },
  {
    "name": "Snowpark",
    "ring": "trial",
    "quadrant": "languages-and-frameworks",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><a href=\"\"https://docs.snowflake.com/en/developer-guide/snowpark/index\"\" target=\"\"_blank\"\" aria-label=\"\"Snowpark. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\"><strong>Snowpark</strong><span class=\"\"pop-out-icon\"\"></span></a> is a library for querying and processing data at scale in <a href=\"\"https://www.thoughtworks.com/radar/platforms/snowflake\"\">Snowflake</a>. Our teams use it for writing manageable code for interacting with data residing in Snowflake — it's akin to writing Spark code but for Snowflake. Ultimately, it's an engine that translates code into SQL that Snowflake understands. You can build applications that process data in Snowflake without moving data to the system where your application code runs. One drawback: unit testing support is suboptimal; our teams compensate for that by writing other types of tests.</p>\""
  },
  {
    "name": "Baseline Profiles",
    "ring": "assess",
    "quadrant": "languages-and-frameworks",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://developer.android.com/topic/performance/baselineprofiles/overview\"\" target=\"\"_blank\"\" aria-label=\"\"Baseline Profiles. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Baseline Profiles<span class=\"\"pop-out-icon\"\"></span></a></strong> — not to be confused with <a href=\"\"https://developer.android.com/ndk/guides/graphics/android-baseline-profile\"\" target=\"\"_blank\"\" aria-label=\"\"Android Baseline profiles. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Android Baseline profiles<span class=\"\"pop-out-icon\"\"></span></a> — are Android Runtime profiles that guide ahead-of-time compilation. They're created once per release on a development machine and are shipped with the application, making them available faster than relying on Cloud Profiles, an older, related technology. The run time uses the Baseline Profile in an app or library to optimize important code paths, which improves the experience for new and existing users when the app is downloaded or updated. Creating Baseline Profiles is <a href=\"\"https://developer.android.com/topic/performance/baselineprofiles/create-baselineprofile\"\" target=\"\"_blank\"\" aria-label=\"\"relatively straightforward. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">relatively straightforward<span class=\"\"pop-out-icon\"\"></span></a> and can lead to significant (up to 30%) performance boosts according to its documentation.</p>\""
  },
  {
    "name": "GGML",
    "ring": "assess",
    "quadrant": "languages-and-frameworks",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><a href=\"\"https://github.com/ggerganov/ggml\"\" target=\"\"_blank\"\" aria-label=\"\"GGML. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\"><strong>GGML</strong><span class=\"\"pop-out-icon\"\"></span></a> is a C library for machine learning that allows for CPU inferencing. It defines a binary format for distributing large language models (LLMs). To do that it uses <a href=\"\"https://en.wikipedia.org/wiki/Quantization_(signal_processing)\"\" target=\"\"_blank\"\" aria-label=\"\"quantization. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">quantization<span class=\"\"pop-out-icon\"\"></span></a>, a technique that allows LLMs to run on consumer hardware with effective CPU inferencing. GGML supports a number of different quantization strategies (e.g., 4-bit, 5-bit, and 8-bit quantization), each of which offers different trade-offs between efficiency and performance. A quick way to test, run and build apps with these quantized models is a Python binding called <a href=\"\"https://github.com/marella/ctransformers\"\" target=\"\"_blank\"\" aria-label=\"\"C Transformers. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">C Transformers<span class=\"\"pop-out-icon\"\"></span></a>. This is a Python wrapper on top of GGML that takes away the boilerplate code for inferencing by providing a high level API. We've leveraged these libraries to build proof of concepts and experiments. If you're considering <a href=\"\"https://www.thoughtworks.com/radar/techniques/self-hosted-llms\"\">self-hosted LLMs</a>, carefully assess these community-supported libraries for your organization.</p>\""
  },
  {
    "name": "GPTCache",
    "ring": "assess",
    "quadrant": "languages-and-frameworks",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><a href=\"\"https://github.com/zilliztech/GPTCache\"\" target=\"\"_blank\"\" aria-label=\"\"GPTCache. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\"><strong>GPTCache</strong><span class=\"\"pop-out-icon\"\"></span></a> is a semantic cache library for large language models (LLMs). We see the need for a cache layer in front of LLMs for two main reasons — to improve the overall performance by reducing external API calls and to reduce the cost of operation by caching similar responses. Unlike traditional caching approaches that look for exact matches, LLM-based caching solutions require similar or related matches for the input queries. GPTCache approaches this with the help of embedding algorithms to convert the input queries into embeddings and then use a vector datastore for similarity search on these embeddings. One drawback of such a design is that you may encounter false positives during cache hits or false negatives during cache misses, which is why we recommend you carefully assess GPTCache for your LLM-based applications.</p>\""
  },
  {
    "name": "Grammatical Inflection API",
    "ring": "assess",
    "quadrant": "languages-and-frameworks",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>In many languages, gender is more visible than in English, and words change based on gender. Addressing users, for example, can require words to be inflected, but it is common practice to use the masculine form by default. There is evidence that this has a <a href=\"\"https://www.nature.com/articles/s41539-021-00087-7\"\" target=\"\"_blank\"\" aria-label=\"\"negative impact. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">negative impact<span class=\"\"pop-out-icon\"\"></span></a> on performance and attitude — and, of course, it's impolite. Workarounds using gender-neutral language can often feel clumsy. Addressing users correctly, then, is the preferred option, and with the <strong><a href=\"\"https://developer.android.com/about/versions/14/features/grammatical-inflection\"\" target=\"\"_blank\"\" aria-label=\"\"Grammatical Inflection API. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Grammatical Inflection API<span class=\"\"pop-out-icon\"\"></span></a></strong>, introduced in Android 14, Android developers now have an easier path to do so.</p>\""
  },
  {
    "name": "htmx",
    "ring": "assess",
    "quadrant": "languages-and-frameworks",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://htmx.org/\"\" target=\"\"_blank\"\" aria-label=\"\"htmx. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">htmx<span class=\"\"pop-out-icon\"\"></span></a></strong> is a small, neat HTML UI library that recently became popular seemingly out of nowhere. During our Radar discussion, we found its predecessor <a href=\"\"https://github.com/bigskysoftware/intercooler-js\"\" target=\"\"_blank\"\" aria-label=\"\"intercooler.js. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">intercooler.js<span class=\"\"pop-out-icon\"\"></span></a> existed ten years ago. Unlike other increasingly complex pre-compiled JavaScript/TypeScript frameworks, htmx encourages the direct use of HTML attributes to access operations such as AJAX, CSS transitions, WebSockets and Server-Sent Events. There's nothing technically sophisticated about htmx, but its popularity recalls the simplicity of hypertext in the early days of the web. The project’s website also features some <a href=\"\"https://htmx.org/essays/\"\" target=\"\"_blank\"\" aria-label=\"\"insightful (and amusing) essays. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">insightful (and amusing) essays<span class=\"\"pop-out-icon\"\"></span></a> on hypermedia and web development, which suggests the team behind htmx have thought carefully about its purpose and philosophy.</p>\""
  },
  {
    "name": "Kotlin Kover",
    "ring": "assess",
    "quadrant": "languages-and-frameworks",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><a href=\"\"https://github.com/Kotlin/kotlinx-kover\"\" target=\"\"_blank\"\" aria-label=\"\"Kotlin Kover. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\"><strong>Kotlin Kover</strong><span class=\"\"pop-out-icon\"\"></span></a> is a code coverage tool set designed specifically for <a href=\"\"https://www.thoughtworks.com/radar/languages-and-frameworks/kotlin\"\">Kotlin</a>, supporting Kotlin JVM, <a href=\"\"https://www.thoughtworks.com/radar/languages-and-frameworks/kotlin-multiplatform-mobile\"\">Multiplatform</a> and Android projects. The significance of code coverage lies in its ability to spotlight untested segments, which reinforces software reliability. As Kover evolves, it stands out because of its ability to produce comprehensive HTML and XML reports, coupled with unmatched precision tailored to Kotlin. For teams deeply rooted in Kotlin, we advise you to assess Kover to leverage its potential in enhancing code quality.</p>\""
  },
  {
    "name": "LangChain",
    "ring": "assess",
    "quadrant": "languages-and-frameworks",
    "isNew": "FALSE",
    "status": "no change",
    "description": "\"<p><strong><a href=\"\"https://github.com/hwchase17/langchain\"\" target=\"\"_blank\"\" aria-label=\"\"LangChain. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">LangChain<span class=\"\"pop-out-icon\"\"></span></a></strong> is a framework for building applications with large language models (LLMs). To build practical LLM products, you need to combine them with user- or domain-specific data which wasn’t part of the training. LangChain fills this niche with features like prompt management, chaining, <a href=\"\"https://python.langchain.com/docs/modules/agents/\"\" target=\"\"_blank\"\" aria-label=\"\"agents. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">agents<span class=\"\"pop-out-icon\"\"></span></a> and document loaders. The benefit of components like prompt templates and document loaders is that they can speed up your time to market. Although it's a popular choice for implementing <a href=\"\"https://www.thoughtworks.com/radar/techniques/retrieval-augmented-generation-rag\"\">Retrieval-Augmented Generation</a> applications and the <a href=\"\"https://www.thoughtworks.com/radar/techniques/react-prompting\"\">ReAct prompting</a> pattern, LangChain has been <a href=\"\"https://minimaxir.com/2023/07/langchain-problem/\"\" target=\"\"_blank\"\" aria-label=\"\"criticized. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">criticized<span class=\"\"pop-out-icon\"\"></span></a> for being hard to use and overcomplicated. When choosing a tech stack for your LLM application, you may want to keep looking for similar frameworks — like <a href=\"\"https://www.thoughtworks.com/radar/languages-and-frameworks/semantic-kernel\"\">Semantic Kernel</a> — in this fast-evolving space.</p>\""
  },
  {
    "name": "LlamaIndex",
    "ring": "assess",
    "quadrant": "languages-and-frameworks",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://www.llamaindex.ai/\"\" target=\"\"_blank\"\" aria-label=\"\"LlamaIndex. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">LlamaIndex<span class=\"\"pop-out-icon\"\"></span></a></strong> is a data framework designed to facilitate the integration of private or domain-specific data with large language models (LLMs). It offers tools for ingesting data from diverse sources — including APIs, databases and PDFs — and structures this data into a format that LLMs can easily consume. Through various types of \"\"engines,\"\" LlamaIndex enables natural language interactions with this structured data, making it accessible for applications ranging from query-based retrieval to conversational interfaces. Similar to <a href=\"\"https://www.thoughtworks.com/radar/languages-and-frameworks/langchain\"\">LangChain</a>, LlamaIndex’s goal is to accelerate development with LLMs, but it takes more of a data framework approach.</p>\""
  },
  {
    "name": "promptfoo",
    "ring": "assess",
    "quadrant": "languages-and-frameworks",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://github.com/promptfoo/promptfoo\"\" target=\"\"_blank\"\" aria-label=\"\"promptfoo. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">promptfoo<span class=\"\"pop-out-icon\"\"></span></a></strong> enables test-driven <a href=\"\"https://www.thoughtworks.com/radar/techniques/prompt-engineering\"\">prompt engineering</a>. While integrating LLMs in applications, tuning of the prompts to produce optimal, consistent outputs can be time-consuming. You can use promptfoo both as a CLI and a library to systematically test prompts against predefined test cases. The test case, along with assertions, can be set up in a simple YAML config file. This config includes the prompts being tested, the model provider, the assertions and the variable values that will be substituted in the prompts. promptfoo supports many assertions, including checking for equality, JSON structure, similarity, custom functions or even using an LLM to grade the model outputs. If you're looking to automate feedback on prompt and model quality, do assess promptfoo.</p>\""
  },
  {
    "name": "Semantic Kernel",
    "ring": "assess",
    "quadrant": "languages-and-frameworks",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p><strong><a href=\"\"https://pypi.org/project/semantic-kernel/\"\" target=\"\"_blank\"\" aria-label=\"\"Semantic Kernel. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Semantic Kernel<span class=\"\"pop-out-icon\"\"></span></a></strong> is the open-source version of one of the core components in Microsoft's Copilot suite of products. It's a Python library that helps you build applications on top of large language models (LLMs), similar to <a href=\"\"https://www.thoughtworks.com/radar/languages-and-frameworks/langchain\"\">LangChain</a>. Semantic Kernel's core concept is its planner, which lets you build <a href=\"\"https://www.thoughtworks.com/radar/techniques/llm-powered-autonomous-agents\"\">LLM-powered agents</a> that create a plan for a user and then execute it step by step with the help of plugins.</p>\""
  },
  {
    "name": "Spring Modulith",
    "ring": "assess",
    "quadrant": "languages-and-frameworks",
    "isNew": "TRUE",
    "status": "new",
    "description": "\"<p>Although we were early advocates for <a href=\"\"https://www.thoughtworks.com/radar/techniques/microservices\"\">microservices</a> and have seen the pattern used successfully on myriad systems, we've also seen microservices misapplied and abused, often as the result of <a href=\"\"https://www.thoughtworks.com/radar/techniques/microservice-envy\"\">microservice envy</a>. Rather than start a new system with a collection of separately deployed processes, it's often advisable to start with a well-factored monolith and only break out separately deployable units when the application reaches a scale where the benefits of microservices outweigh the additional complexity inherent in distributed systems. Recently we've seen a resurgence of interest in this approach and a more detailed definition of what, exactly, constitutes a well-factored monolith. <strong><a href=\"\"https://spring.io/projects/spring-modulith\"\" target=\"\"_blank\"\" aria-label=\"\"Spring Modulith. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">Spring Modulith<span class=\"\"pop-out-icon\"\"></span></a></strong> is a framework that helps you structure your code in a way that makes it easier to break out microservices when the time is right. It provides a way to modularize your code so that the logical concepts of domains and bounded context are aligned with the physical concepts of files and package structure. This alignment makes it easier to refactor the monolith when necessary and to test domains in isolation. Spring Modulith provides an in-process eventing mechanism that helps further decouple modules within a single application. Best of all, it integrates with <a href=\"\"https://www.thoughtworks.com/radar/tools/archunit\"\">ArchUnit</a> and <a href=\"\"https://github.com/xmolecules/jmolecules\"\" target=\"\"_blank\"\" aria-label=\"\"jmolecules. This is an external link. Opens in new tab\"\" class=\"\"pop-out\"\">jmolecules<span class=\"\"pop-out-icon\"\"></span></a> to automate verification of its domain-driven design rules.</p>\""
  }
]
